XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Startup/ch32v4x7.h
/* LTDC Layer Registers */
typedef struct
{
  __IO uint32_t CR;
  __IO uint32_t WHPCR;
  __IO uint32_t WVPCR;
  __IO uint32_t CKCR;
  __IO uint32_t PFCR;
       uint32_t RESERVED0;
  __IO uint32_t DCCR;
       uint32_t RESERVED1;
  __IO uint32_t CFBAR;
  __IO uint32_t CFBLR;
  __IO uint32_t CFBLNR;
  __IO uint32_t CLUTWR;
} LTDC_Layer_TypeDef;

/* PSRAM Registers */
typedef struct
{
  __IO uint32_t CTLR;
  __IO uint32_t TIMING;
  __IO uint32_t DATA;
  __IO uint32_t ADDR;
  __IO uint32_t CMD0_CFG;
  __IO uint32_t CMD1_CFG;
  __IO uint32_t DMACR;
  __IO uint32_t DATA_NUM;
  __IO uint32_t DMA_MEM_ADDR;
  __IO uint32_t DMA_PSRAM_ADDR;
  __IO uint32_t ISR;
  __IO uint32_t IER;
  __IO uint32_t STATUS;
  __IO uint32_t CECFG;
  __IO uint32_t LATENCY;
} PSRAM_TypeDef;

/* Peripheral memory map */
#define FLASH_BASE            ((uint32_t)0x08000000) /* FLASH base address in the alias region */
#define SRAM_BASE             ((uint32_t)0x20000000) /* SRAM base address in the alias region */
#define PERIPH_BASE           ((uint32_t)0x40000000) /* Peripheral base address in the alias region */

#define HBPERIPH_BASE         (PERIPH_BASE)

#define FSMC_R_BASE           ((uint32_t)0xA0000000) /* FSMC registers base address */

#define TIM2_BASE             (HBPERIPH_BASE + 0x00000)
#define TIM3_BASE             (HBPERIPH_BASE + 0x00400)
#define TIM4_BASE             (HBPERIPH_BASE + 0x00800)
#define TIM5_BASE             (HBPERIPH_BASE + 0x00C00)
#define TIM6_BASE             (HBPERIPH_BASE + 0x01000)
#define TIM7_BASE             (HBPERIPH_BASE + 0x01400)
#define USART6_BASE           (HBPERIPH_BASE + 0x01800)
#define USART7_BASE           (HBPERIPH_BASE + 0x01C00)
#define USART8_BASE           (HBPERIPH_BASE + 0x02000)
#define RTC_BASE              (HBPERIPH_BASE + 0x02800)
#define WWDG_BASE             (HBPERIPH_BASE + 0x02C00)
#define IWDG_BASE             (HBPERIPH_BASE + 0x03000)
#define SPI2_BASE             (HBPERIPH_BASE + 0x03800)
#define SPI3_BASE             (HBPERIPH_BASE + 0x03C00)
#define USART2_BASE           (HBPERIPH_BASE + 0x04400)
#define USART3_BASE           (HBPERIPH_BASE + 0x04800)
#define USART4_BASE           (HBPERIPH_BASE + 0x04C00)
#define USART5_BASE           (HBPERIPH_BASE + 0x05000)
#define I2C1_BASE             (HBPERIPH_BASE + 0x05400)
#define CAN1_BASE             (HBPERIPH_BASE + 0x06400)
#define BKP_BASE              (HBPERIPH_BASE + 0x06C00)
#define PWR_BASE              (HBPERIPH_BASE + 0x07000)
#define DAC_BASE              (HBPERIPH_BASE + 0x07400)
#define USART9_BASE           (HBPERIPH_BASE + 0x07800)
#define USART10_BASE          (HBPERIPH_BASE + 0x07C00)

#define AFIO_BASE             (HBPERIPH_BASE + 0x10000)
#define EXTI_BASE             (HBPERIPH_BASE + 0x10400)
#define GPIOA_BASE            (HBPERIPH_BASE + 0x10800)
#define GPIOB_BASE            (HBPERIPH_BASE + 0x10C00)
#define GPIOC_BASE            (HBPERIPH_BASE + 0x11000)
#define GPIOD_BASE            (HBPERIPH_BASE + 0x11400)
#define GPIOE_BASE            (HBPERIPH_BASE + 0x11800)
#define ADC1_BASE             (HBPERIPH_BASE + 0x12400)
#define ADC2_BASE             (HBPERIPH_BASE + 0x12800)
#define TIM1_BASE             (HBPERIPH_BASE + 0x12C00)
#define SPI1_BASE             (HBPERIPH_BASE + 0x13000)
#define TIM8_BASE             (HBPERIPH_BASE + 0x13400)
#define USART1_BASE           (HBPERIPH_BASE + 0x13800)
#define SDIO_BASE             (HBPERIPH_BASE + 0x18000)

#define DMA1_BASE             (HBPERIPH_BASE + 0x20000)
#define DMA1_Channel1_BASE    (HBPERIPH_BASE + 0x20008)
#define DMA1_Channel2_BASE    (HBPERIPH_BASE + 0x2001C)
#define DMA1_Channel3_BASE    (HBPERIPH_BASE + 0x20030)
#define DMA1_Channel4_BASE    (HBPERIPH_BASE + 0x20044)
#define DMA1_Channel5_BASE    (HBPERIPH_BASE + 0x20058)
#define DMA1_Channel6_BASE    (HBPERIPH_BASE + 0x2006C)
#define DMA1_Channel7_BASE    (HBPERIPH_BASE + 0x20080)
#define DMA1_Channel8_BASE    (HBPERIPH_BASE + 0x20090)
#define DMA1_Channel9_BASE    (HBPERIPH_BASE + 0x200A0)
#define DMA1_Channel10_BASE   (HBPERIPH_BASE + 0x200B0)
#define DMA1_Channel11_BASE   (HBPERIPH_BASE + 0x200C0)
#define DMA1_Channel12_BASE   (HBPERIPH_BASE + 0x200D0)
#define DMA1_Channel13_BASE   (HBPERIPH_BASE + 0x200E0)
#define DMA1_EXTEN_BASE       (HBPERIPH_BASE + 0x200F0)
#define DMA2_BASE             (HBPERIPH_BASE + 0x20400)
#define DMA2_Channel1_BASE    (HBPERIPH_BASE + 0x20408)
#define DMA2_Channel2_BASE    (HBPERIPH_BASE + 0x2041C)
#define DMA2_Channel3_BASE    (HBPERIPH_BASE + 0x20430)
#define DMA2_Channel4_BASE    (HBPERIPH_BASE + 0x20444)
#define DMA2_Channel5_BASE    (HBPERIPH_BASE + 0x20458)
#define DMA2_Channel6_BASE    (HBPERIPH_BASE + 0x2046C)
#define DMA2_Channel7_BASE    (HBPERIPH_BASE + 0x20480)
#define DMA2_Channel8_BASE    (HBPERIPH_BASE + 0x20490)
#define DMA2_Channel9_BASE    (HBPERIPH_BASE + 0x204A0)
#define DMA2_Channel10_BASE   (HBPERIPH_BASE + 0x204B0)
#define DMA2_Channel11_BASE   (HBPERIPH_BASE + 0x204C0)
#define DMA2_EXTEN_BASE       (HBPERIPH_BASE + 0x204D0)
#define RCC_BASE              (HBPERIPH_BASE + 0x21000)
#define FLASH_R_BASE          (HBPERIPH_BASE + 0x22000)
#define CRC_BASE              (HBPERIPH_BASE + 0x23000)
#define USBHS2_BASE           (HBPERIPH_BASE + 0x23400)
#define EXTEN_BASE            (HBPERIPH_BASE + 0x23800)
#define OPA_BASE              (HBPERIPH_BASE + 0x23804)
#define RNG_BASE              (HBPERIPH_BASE + 0x23C00)
#define USBHS1_BASE           (HBPERIPH_BASE + 0x24000)
#define PSRAM_BASE            (HBPERIPH_BASE + 0x24400)
#define LTDC_BASE             (HBPERIPH_BASE + 0x24800)
#define LTDC_L_BASE           (HBPERIPH_BASE + 0x24834)
#define I3C_BASE              (HBPERIPH_BASE + 0x24C00)
#define ARGB_BASE             (HBPERIPH_BASE + 0x25000)
#define ETH_BASE              (HBPERIPH_BASE + 0x28000)
#define ETH_MAC_BASE          (ETH_BASE)
#define ETH_MMC_BASE          (ETH_BASE + 0x0100)
#define ETH_PTP_BASE          (ETH_BASE + 0x0700)
#define ETH_DMA_BASE          (ETH_BASE + 0x1000)

