XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Startup/ch32v4x7.h
/******************  Bit definition for CAN_TXMDL0R register  *******************/
#define  CAN_TXMDL0R_DATA0                           ((uint32_t)0x000000FF) /* Data byte 0 */
#define  CAN_TXMDL0R_DATA1                           ((uint32_t)0x0000FF00) /* Data byte 1 */
#define  CAN_TXMDL0R_DATA2                           ((uint32_t)0x00FF0000) /* Data byte 2 */
#define  CAN_TXMDL0R_DATA3                           ((uint32_t)0xFF000000) /* Data byte 3 */

/******************  Bit definition for CAN_TXMDH0R register  *******************/
#define  CAN_TXMDH0R_DATA4                           ((uint32_t)0x000000FF) /* Data byte 4 */
#define  CAN_TXMDH0R_DATA5                           ((uint32_t)0x0000FF00) /* Data byte 5 */
#define  CAN_TXMDH0R_DATA6                           ((uint32_t)0x00FF0000) /* Data byte 6 */
#define  CAN_TXMDH0R_DATA7                           ((uint32_t)0xFF000000) /* Data byte 7 */

/*******************  Bit definition for CAN_TXMI1R register  *******************/
#define  CAN_TXMI1R_TXRQ                             ((uint32_t)0x00000001) /* Transmit Mailbox Request */
#define  CAN_TXMI1R_RTR                              ((uint32_t)0x00000002) /* Remote Transmission Request */
#define  CAN_TXMI1R_IDE                              ((uint32_t)0x00000004) /* Identifier Extension */
#define  CAN_TXMI1R_EXID                             ((uint32_t)0x001FFFF8) /* Extended Identifier */
#define  CAN_TXMI1R_STID                             ((uint32_t)0xFFE00000) /* Standard Identifier or Extended Identifier */

/*******************  Bit definition for CAN_TXMDT1R register  ******************/
#define  CAN_TXMDT1R_DLC                             ((uint32_t)0x0000000F) /* Data Length Code */
#define  CAN_TXMDT1R_TGT                             ((uint32_t)0x00000100) /* Transmit Global Time */
#define  CAN_TXMDT1R_TIME                            ((uint32_t)0xFFFF0000) /* Message Time Stamp */

/*******************  Bit definition for CAN_TXMDL1R register  ******************/
#define  CAN_TXMDL1R_DATA0                           ((uint32_t)0x000000FF) /* Data byte 0 */
#define  CAN_TXMDL1R_DATA1                           ((uint32_t)0x0000FF00) /* Data byte 1 */
#define  CAN_TXMDL1R_DATA2                           ((uint32_t)0x00FF0000) /* Data byte 2 */
#define  CAN_TXMDL1R_DATA3                           ((uint32_t)0xFF000000) /* Data byte 3 */

/*******************  Bit definition for CAN_TXMDH1R register  ******************/
#define  CAN_TXMDH1R_DATA4                           ((uint32_t)0x000000FF) /* Data byte 4 */
#define  CAN_TXMDH1R_DATA5                           ((uint32_t)0x0000FF00) /* Data byte 5 */
#define  CAN_TXMDH1R_DATA6                           ((uint32_t)0x00FF0000) /* Data byte 6 */
#define  CAN_TXMDH1R_DATA7                           ((uint32_t)0xFF000000) /* Data byte 7 */

/*******************  Bit definition for CAN_TXMI2R register  *******************/
#define  CAN_TXMI2R_TXRQ                             ((uint32_t)0x00000001) /* Transmit Mailbox Request */
#define  CAN_TXMI2R_RTR                              ((uint32_t)0x00000002) /* Remote Transmission Request */
#define  CAN_TXMI2R_IDE                              ((uint32_t)0x00000004) /* Identifier Extension */
#define  CAN_TXMI2R_EXID                             ((uint32_t)0x001FFFF8) /* Extended identifier */
#define  CAN_TXMI2R_STID                             ((uint32_t)0xFFE00000) /* Standard Identifier or Extended Identifier */

/*******************  Bit definition for CAN_TXMDT2R register  ******************/
#define  CAN_TXMDT2R_DLC                             ((uint32_t)0x0000000F) /* Data Length Code */
#define  CAN_TXMDT2R_TGT                             ((uint32_t)0x00000100) /* Transmit Global Time */
#define  CAN_TXMDT2R_TIME                            ((uint32_t)0xFFFF0000) /* Message Time Stamp */

/*******************  Bit definition for CAN_TXMDL2R register  ******************/
#define  CAN_TXMDL2R_DATA0                           ((uint32_t)0x000000FF) /* Data byte 0 */
#define  CAN_TXMDL2R_DATA1                           ((uint32_t)0x0000FF00) /* Data byte 1 */
#define  CAN_TXMDL2R_DATA2                           ((uint32_t)0x00FF0000) /* Data byte 2 */
#define  CAN_TXMDL2R_DATA3                           ((uint32_t)0xFF000000) /* Data byte 3 */

/*******************  Bit definition for CAN_TXMDH2R register  ******************/
#define  CAN_TXMDH2R_DATA4                           ((uint32_t)0x000000FF) /* Data byte 4 */
#define  CAN_TXMDH2R_DATA5                           ((uint32_t)0x0000FF00) /* Data byte 5 */
#define  CAN_TXMDH2R_DATA6                           ((uint32_t)0x00FF0000) /* Data byte 6 */
#define  CAN_TXMDH2R_DATA7                           ((uint32_t)0xFF000000) /* Data byte 7 */

/*******************  Bit definition for CAN_RXMI0R register  *******************/
#define  CAN_RXMIOR_FDF                              ((uint32_t)0x00000001)
#define  CAN_RXMI0R_RTR                              ((uint32_t)0x00000002) /* Remote Transmission Request */
#define  CAN_RXMI0R_IDE                              ((uint32_t)0x00000004) /* Identifier Extension */
#define  CAN_RXMI0R_EXID                             ((uint32_t)0x001FFFF8) /* Extended Identifier */
#define  CAN_RXMI0R_STID                             ((uint32_t)0xFFE00000) /* Standard Identifier or Extended Identifier */

/*******************  Bit definition for CAN_RXMDT0R register  ******************/
#define  CAN_RXMDT0R_DLC                             ((uint32_t)0x0000000F) /* Data Length Code */
#define  CAN_RXMDT0R_BRS                             ((uint32_t)0x00000010)
#define  CAN_RXMDT0R_ESI                             ((uint32_t)0x00000020)
#define  CAN_RXMDH0R_RES                             ((uint32_t)0x00000040)
#define  CAN_RXMDH0R_FMI                             ((uint32_t)0x0000FF00)
#define  CAN_RXMDT0R_TIME                            ((uint32_t)0xFFFF0000) /* Message Time Stamp */

/*******************  Bit definition for CAN_RXMDL0R register  ******************/
#define  CAN_RXMDL0R_DATA0                           ((uint32_t)0x000000FF) /* Data byte 0 */
#define  CAN_RXMDL0R_DATA1                           ((uint32_t)0x0000FF00) /* Data byte 1 */
#define  CAN_RXMDL0R_DATA2                           ((uint32_t)0x00FF0000) /* Data byte 2 */
#define  CAN_RXMDL0R_DATA3                           ((uint32_t)0xFF000000) /* Data byte 3 */

/*******************  Bit definition for CAN_RXMDH0R register  ******************/
#define  CAN_RXMDH0R_DATA4                           ((uint32_t)0x000000FF) /* Data byte 4 */
#define  CAN_RXMDH0R_DATA5                           ((uint32_t)0x0000FF00) /* Data byte 5 */
#define  CAN_RXMDH0R_DATA6                           ((uint32_t)0x00FF0000) /* Data byte 6 */
#define  CAN_RXMDH0R_DATA7                           ((uint32_t)0xFF000000) /* Data byte 7 */

/*******************  Bit definition for CAN_FCTLR register  ******************/
#define  CAN_FCTLR_FINIT                             ((uint32_t)0x00000001)

/*******************  Bit definition for CAN_FMCFGR register  ******************/
#define  CAN_FMCFGR_FBM                              ((uint16_t)0x3FFF)
#define  CAN_FMCFGR_FBM0                             ((uint16_t)0x0001)
#define  CAN_FMCFGR_FBM1                             ((uint16_t)0x0002)
#define  CAN_FMCFGR_FBM2                             ((uint16_t)0x0004)
#define  CAN_FMCFGR_FBM3                             ((uint16_t)0x0008)
#define  CAN_FMCFGR_FBM4                             ((uint16_t)0x0010)
#define  CAN_FMCFGR_FBM5                             ((uint16_t)0x0020)
#define  CAN_FMCFGR_FBM6                             ((uint16_t)0x0040)
#define  CAN_FMCFGR_FBM7                             ((uint16_t)0x0080)
#define  CAN_FMCFGR_FBM8                             ((uint16_t)0x0100)
#define  CAN_FMCFGR_FBM9                             ((uint16_t)0x0200)
#define  CAN_FMCFGR_FBM10                            ((uint16_t)0x0400)
#define  CAN_FMCFGR_FBM11                            ((uint16_t)0x0800)
#define  CAN_FMCFGR_FBM12                            ((uint16_t)0x1000)
#define  CAN_FMCFGR_FBM13                            ((uint16_t)0x2000)

/*******************  Bit definition for CAN_FSCFGR register  *******************/
#define  CAN_FSCFGR_FSC                              ((uint16_t)0x3FFF)            /* Filter Scale Configuration */
#define  CAN_FSCFGR_FSC0                             ((uint16_t)0x0001)            /* Filter Scale Configuration bit 0 */
#define  CAN_FSCFGR_FSC1                             ((uint16_t)0x0002)            /* Filter Scale Configuration bit 1 */
#define  CAN_FSCFGR_FSC2                             ((uint16_t)0x0004)            /* Filter Scale Configuration bit 2 */
#define  CAN_FSCFGR_FSC3                             ((uint16_t)0x0008)            /* Filter Scale Configuration bit 3 */
#define  CAN_FSCFGR_FSC4                             ((uint16_t)0x0010)            /* Filter Scale Configuration bit 4 */
#define  CAN_FSCFGR_FSC5                             ((uint16_t)0x0020)            /* Filter Scale Configuration bit 5 */
#define  CAN_FSCFGR_FSC6                             ((uint16_t)0x0040)            /* Filter Scale Configuration bit 6 */
#define  CAN_FSCFGR_FSC7                             ((uint16_t)0x0080)            /* Filter Scale Configuration bit 7 */
#define  CAN_FSCFGR_FSC8                             ((uint16_t)0x0100)            /* Filter Scale Configuration bit 8 */
#define  CAN_FSCFGR_FSC9                             ((uint16_t)0x0200)            /* Filter Scale Configuration bit 9 */
#define  CAN_FSCFGR_FSC10                            ((uint16_t)0x0400)            /* Filter Scale Configuration bit 10 */
#define  CAN_FSCFGR_FSC11                            ((uint16_t)0x0800)            /* Filter Scale Configuration bit 11 */
#define  CAN_FSCFGR_FSC12                            ((uint16_t)0x1000)            /* Filter Scale Configuration bit 12 */
#define  CAN_FSCFGR_FSC13                            ((uint16_t)0x2000)            /* Filter Scale Configuration bit 13 */

/******************  Bit definition for CAN_FAFIFOR register  *******************/
#define  CAN_FAFIFOR_FFA                             ((uint16_t)0x3FFF)            /* Filter FIFO Assignment */
#define  CAN_FAFIFOR_FFA0                            ((uint16_t)0x0001)            /* Filter FIFO Assignment for Filter 0 */
#define  CAN_FAFIFOR_FFA1                            ((uint16_t)0x0002)            /* Filter FIFO Assignment for Filter 1 */
#define  CAN_FAFIFOR_FFA2                            ((uint16_t)0x0004)            /* Filter FIFO Assignment for Filter 2 */
#define  CAN_FAFIFOR_FFA3                            ((uint16_t)0x0008)            /* Filter FIFO Assignment for Filter 3 */
#define  CAN_FAFIFOR_FFA4                            ((uint16_t)0x0010)            /* Filter FIFO Assignment for Filter 4 */
#define  CAN_FAFIFOR_FFA5                            ((uint16_t)0x0020)            /* Filter FIFO Assignment for Filter 5 */
#define  CAN_FAFIFOR_FFA6                            ((uint16_t)0x0040)            /* Filter FIFO Assignment for Filter 6 */
#define  CAN_FAFIFOR_FFA7                            ((uint16_t)0x0080)            /* Filter FIFO Assignment for Filter 7 */
#define  CAN_FAFIFOR_FFA8                            ((uint16_t)0x0100)            /* Filter FIFO Assignment for Filter 8 */
#define  CAN_FAFIFOR_FFA9                            ((uint16_t)0x0200)            /* Filter FIFO Assignment for Filter 9 */
#define  CAN_FAFIFOR_FFA10                           ((uint16_t)0x0400)            /* Filter FIFO Assignment for Filter 10 */
#define  CAN_FAFIFOR_FFA11                           ((uint16_t)0x0800)            /* Filter FIFO Assignment for Filter 11 */
#define  CAN_FAFIFOR_FFA12                           ((uint16_t)0x1000)            /* Filter FIFO Assignment for Filter 12 */
#define  CAN_FAFIFOR_FFA13                           ((uint16_t)0x2000)            /* Filter FIFO Assignment for Filter 13 */

/*******************  Bit definition for CAN_FWR register  *******************/
#define  CAN_FWR_FACT                                ((uint16_t)0x3FFF)            /* Filter Active */
#define  CAN_FWR_FACT0                               ((uint16_t)0x0001)            /* Filter 0 Active */
#define  CAN_FWR_FACT1                               ((uint16_t)0x0002)            /* Filter 1 Active */
#define  CAN_FWR_FACT2                               ((uint16_t)0x0004)            /* Filter 2 Active */
#define  CAN_FWR_FACT3                               ((uint16_t)0x0008)            /* Filter 3 Active */
#define  CAN_FWR_FACT4                               ((uint16_t)0x0010)            /* Filter 4 Active */
#define  CAN_FWR_FACT5                               ((uint16_t)0x0020)            /* Filter 5 Active */
#define  CAN_FWR_FACT6                               ((uint16_t)0x0040)            /* Filter 6 Active */
#define  CAN_FWR_FACT7                               ((uint16_t)0x0080)            /* Filter 7 Active */
#define  CAN_FWR_FACT8                               ((uint16_t)0x0100)            /* Filter 8 Active */
#define  CAN_FWR_FACT9                               ((uint16_t)0x0200)            /* Filter 9 Active */
#define  CAN_FWR_FACT10                              ((uint16_t)0x0400)            /* Filter 10 Active */
#define  CAN_FWR_FACT11                              ((uint16_t)0x0800)            /* Filter 11 Active */
#define  CAN_FWR_FACT12                              ((uint16_t)0x1000)            /* Filter 12 Active */
#define  CAN_FWR_FACT13                              ((uint16_t)0x2000)            /* Filter 13 Active */

/*******************  Bit definition for CAN_F0R1 register  *******************/
#define  CAN_F0R1_FB0                                ((uint32_t)0x00000001)        /* Filter bit 0 */
#define  CAN_F0R1_FB1                                ((uint32_t)0x00000002)        /* Filter bit 1 */
#define  CAN_F0R1_FB2                                ((uint32_t)0x00000004)        /* Filter bit 2 */
#define  CAN_F0R1_FB3                                ((uint32_t)0x00000008)        /* Filter bit 3 */
#define  CAN_F0R1_FB4                                ((uint32_t)0x00000010)        /* Filter bit 4 */
#define  CAN_F0R1_FB5                                ((uint32_t)0x00000020)        /* Filter bit 5 */
#define  CAN_F0R1_FB6                                ((uint32_t)0x00000040)        /* Filter bit 6 */
#define  CAN_F0R1_FB7                                ((uint32_t)0x00000080)        /* Filter bit 7 */
#define  CAN_F0R1_FB8                                ((uint32_t)0x00000100)        /* Filter bit 8 */
#define  CAN_F0R1_FB9                                ((uint32_t)0x00000200)        /* Filter bit 9 */
#define  CAN_F0R1_FB10                               ((uint32_t)0x00000400)        /* Filter bit 10 */
#define  CAN_F0R1_FB11                               ((uint32_t)0x00000800)        /* Filter bit 11 */
#define  CAN_F0R1_FB12                               ((uint32_t)0x00001000)        /* Filter bit 12 */
#define  CAN_F0R1_FB13                               ((uint32_t)0x00002000)        /* Filter bit 13 */
#define  CAN_F0R1_FB14                               ((uint32_t)0x00004000)        /* Filter bit 14 */
#define  CAN_F0R1_FB15                               ((uint32_t)0x00008000)        /* Filter bit 15 */
#define  CAN_F0R1_FB16                               ((uint32_t)0x00010000)        /* Filter bit 16 */
#define  CAN_F0R1_FB17                               ((uint32_t)0x00020000)        /* Filter bit 17 */
#define  CAN_F0R1_FB18                               ((uint32_t)0x00040000)        /* Filter bit 18 */
#define  CAN_F0R1_FB19                               ((uint32_t)0x00080000)        /* Filter bit 19 */
#define  CAN_F0R1_FB20                               ((uint32_t)0x00100000)        /* Filter bit 20 */
#define  CAN_F0R1_FB21                               ((uint32_t)0x00200000)        /* Filter bit 21 */
#define  CAN_F0R1_FB22                               ((uint32_t)0x00400000)        /* Filter bit 22 */
#define  CAN_F0R1_FB23                               ((uint32_t)0x00800000)        /* Filter bit 23 */
#define  CAN_F0R1_FB24                               ((uint32_t)0x01000000)        /* Filter bit 24 */
#define  CAN_F0R1_FB25                               ((uint32_t)0x02000000)        /* Filter bit 25 */
#define  CAN_F0R1_FB26                               ((uint32_t)0x04000000)        /* Filter bit 26 */
#define  CAN_F0R1_FB27                               ((uint32_t)0x08000000)        /* Filter bit 27 */
#define  CAN_F0R1_FB28                               ((uint32_t)0x10000000)        /* Filter bit 28 */
#define  CAN_F0R1_FB29                               ((uint32_t)0x20000000)        /* Filter bit 29 */
#define  CAN_F0R1_FB30                               ((uint32_t)0x40000000)        /* Filter bit 30 */
#define  CAN_F0R1_FB31                               ((uint32_t)0x80000000)        /* Filter bit 31 */

/*******************  Bit definition for CAN_F1R1 register  *******************/
#define  CAN_F1R1_FB0                                ((uint32_t)0x00000001)        /* Filter bit 0 */
#define  CAN_F1R1_FB1                                ((uint32_t)0x00000002)        /* Filter bit 1 */
#define  CAN_F1R1_FB2                                ((uint32_t)0x00000004)        /* Filter bit 2 */
#define  CAN_F1R1_FB3                                ((uint32_t)0x00000008)        /* Filter bit 3 */
#define  CAN_F1R1_FB4                                ((uint32_t)0x00000010)        /* Filter bit 4 */
#define  CAN_F1R1_FB5                                ((uint32_t)0x00000020)        /* Filter bit 5 */
#define  CAN_F1R1_FB6                                ((uint32_t)0x00000040)        /* Filter bit 6 */
#define  CAN_F1R1_FB7                                ((uint32_t)0x00000080)        /* Filter bit 7 */
#define  CAN_F1R1_FB8                                ((uint32_t)0x00000100)        /* Filter bit 8 */
#define  CAN_F1R1_FB9                                ((uint32_t)0x00000200)        /* Filter bit 9 */
#define  CAN_F1R1_FB10                               ((uint32_t)0x00000400)        /* Filter bit 10 */
#define  CAN_F1R1_FB11                               ((uint32_t)0x00000800)        /* Filter bit 11 */
#define  CAN_F1R1_FB12                               ((uint32_t)0x00001000)        /* Filter bit 12 */
#define  CAN_F1R1_FB13                               ((uint32_t)0x00002000)        /* Filter bit 13 */
#define  CAN_F1R1_FB14                               ((uint32_t)0x00004000)        /* Filter bit 14 */
#define  CAN_F1R1_FB15                               ((uint32_t)0x00008000)        /* Filter bit 15 */
#define  CAN_F1R1_FB16                               ((uint32_t)0x00010000)        /* Filter bit 16 */
#define  CAN_F1R1_FB17                               ((uint32_t)0x00020000)        /* Filter bit 17 */
#define  CAN_F1R1_FB18                               ((uint32_t)0x00040000)        /* Filter bit 18 */
#define  CAN_F1R1_FB19                               ((uint32_t)0x00080000)        /* Filter bit 19 */
#define  CAN_F1R1_FB20                               ((uint32_t)0x00100000)        /* Filter bit 20 */
#define  CAN_F1R1_FB21                               ((uint32_t)0x00200000)        /* Filter bit 21 */
#define  CAN_F1R1_FB22                               ((uint32_t)0x00400000)        /* Filter bit 22 */
#define  CAN_F1R1_FB23                               ((uint32_t)0x00800000)        /* Filter bit 23 */
#define  CAN_F1R1_FB24                               ((uint32_t)0x01000000)        /* Filter bit 24 */
#define  CAN_F1R1_FB25                               ((uint32_t)0x02000000)        /* Filter bit 25 */
#define  CAN_F1R1_FB26                               ((uint32_t)0x04000000)        /* Filter bit 26 */
#define  CAN_F1R1_FB27                               ((uint32_t)0x08000000)        /* Filter bit 27 */
#define  CAN_F1R1_FB28                               ((uint32_t)0x10000000)        /* Filter bit 28 */
#define  CAN_F1R1_FB29                               ((uint32_t)0x20000000)        /* Filter bit 29 */
#define  CAN_F1R1_FB30                               ((uint32_t)0x40000000)        /* Filter bit 30 */
#define  CAN_F1R1_FB31                               ((uint32_t)0x80000000)        /* Filter bit 31 */

