XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Startup/ch32v4x7.h
/*******************  Bit definition for DMA_CFGR8 register  *******************/
#define  DMA_CFGR8_EN                                ((uint16_t)0x0001)            /* Channel enable */
#define  DMA_CFGR8_TCIE                              ((uint16_t)0x0002)            /* Transfer complete interrupt enable */
#define  DMA_CFGR8_HTIE                              ((uint16_t)0x0004)            /* Half Transfer interrupt enable */
#define  DMA_CFGR8_TEIE                              ((uint16_t)0x0008)            /* Transfer error interrupt enable */
#define  DMA_CFGR8_DIR                               ((uint16_t)0x0010)            /* Data transfer direction */
#define  DMA_CFGR8_CIRC                              ((uint16_t)0x0020)            /* Circular mode */
#define  DMA_CFGR8_PINC                              ((uint16_t)0x0040)            /* Peripheral increment mode */
#define  DMA_CFGR8_MINC                              ((uint16_t)0x0080)            /* Memory increment mode */

#define  DMA_CFGR8_PSIZE                             ((uint16_t)0x0300)            /* PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CFGR8_PSIZE_0                           ((uint16_t)0x0100)            /* Bit 0 */
#define  DMA_CFGR8_PSIZE_1                           ((uint16_t)0x0200)            /* Bit 1 */

#define  DMA_CFGR8_MSIZE                             ((uint16_t)0x0C00)            /* MSIZE[1:0] bits (Memory size) */
#define  DMA_CFGR8_MSIZE_0                           ((uint16_t)0x0400)            /* Bit 0 */
#define  DMA_CFGR8_MSIZE_1                           ((uint16_t)0x0800)            /* Bit 1 */

#define  DMA_CFGR8_PL                                ((uint16_t)0x3000)            /* PL[1:0] bits (Channel Priority level) */
#define  DMA_CFGR8_PL_0                              ((uint16_t)0x1000)            /* Bit 0 */
#define  DMA_CFGR8_PL_1                              ((uint16_t)0x2000)            /* Bit 1 */

#define  DMA_CFGR8_MEM2MEM                           ((uint16_t)0x4000)            /* Memory to memory mode */

/*******************  Bit definition for DMA_CFGR9 register  *******************/
#define  DMA_CFGR9_EN                                ((uint16_t)0x0001)            /* Channel enable */
#define  DMA_CFGR9_TCIE                              ((uint16_t)0x0002)            /* Transfer complete interrupt enable */
#define  DMA_CFGR9_HTIE                              ((uint16_t)0x0004)            /* Half Transfer interrupt enable */
#define  DMA_CFGR9_TEIE                              ((uint16_t)0x0008)            /* Transfer error interrupt enable */
#define  DMA_CFGR9_DIR                               ((uint16_t)0x0010)            /* Data transfer direction */
#define  DMA_CFGR9_CIRC                              ((uint16_t)0x0020)            /* Circular mode */
#define  DMA_CFGR9_PINC                              ((uint16_t)0x0040)            /* Peripheral increment mode */
#define  DMA_CFGR9_MINC                              ((uint16_t)0x0080)            /* Memory increment mode */

#define  DMA_CFGR9_PSIZE                             ((uint16_t)0x0300)            /* PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CFGR9_PSIZE_0                           ((uint16_t)0x0100)            /* Bit 0 */
#define  DMA_CFGR9_PSIZE_1                           ((uint16_t)0x0200)            /* Bit 1 */

#define  DMA_CFGR9_MSIZE                             ((uint16_t)0x0C00)            /* MSIZE[1:0] bits (Memory size) */
#define  DMA_CFGR9_MSIZE_0                           ((uint16_t)0x0400)            /* Bit 0 */
#define  DMA_CFGR9_MSIZE_1                           ((uint16_t)0x0800)            /* Bit 1 */

#define  DMA_CFGR9_PL                                ((uint16_t)0x3000)            /* PL[1:0] bits (Channel Priority level) */
#define  DMA_CFGR9_PL_0                              ((uint16_t)0x1000)            /* Bit 0 */
#define  DMA_CFGR9_PL_1                              ((uint16_t)0x2000)            /* Bit 1 */

#define  DMA_CFGR9_MEM2MEM                           ((uint16_t)0x4000)            /* Memory to memory mode */

/*******************  Bit definition for DMA_CFGR10 register  *******************/
#define  DMA_CFGR10_EN                               ((uint16_t)0x0001)            /* Channel enable */
#define  DMA_CFGR10_TCIE                             ((uint16_t)0x0002)            /* Transfer complete interrupt enable */
#define  DMA_CFGR10_HTIE                             ((uint16_t)0x0004)            /* Half Transfer interrupt enable */
#define  DMA_CFGR10_TEIE                             ((uint16_t)0x0008)            /* Transfer error interrupt enable */
#define  DMA_CFGR10_DIR                              ((uint16_t)0x0010)            /* Data transfer direction */
#define  DMA_CFGR10_CIRC                             ((uint16_t)0x0020)            /* Circular mode */
#define  DMA_CFGR10_PINC                             ((uint16_t)0x0040)            /* Peripheral increment mode */
#define  DMA_CFGR10_MINC                             ((uint16_t)0x0080)            /* Memory increment mode */

#define  DMA_CFGR10_PSIZE                            ((uint16_t)0x0300)            /* PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CFGR10_PSIZE_0                          ((uint16_t)0x0100)            /* Bit 0 */
#define  DMA_CFGR10_PSIZE_1                          ((uint16_t)0x0200)            /* Bit 1 */

#define  DMA_CFGR10_MSIZE                            ((uint16_t)0x0C00)            /* MSIZE[1:0] bits (Memory size) */
#define  DMA_CFGR10_MSIZE_0                          ((uint16_t)0x0400)            /* Bit 0 */
#define  DMA_CFGR10_MSIZE_1                          ((uint16_t)0x0800)            /* Bit 1 */

#define  DMA_CFGR10_PL                               ((uint16_t)0x3000)            /* PL[1:0] bits (Channel Priority level) */
#define  DMA_CFGR10_PL_0                             ((uint16_t)0x1000)            /* Bit 0 */
#define  DMA_CFGR10_PL_1                             ((uint16_t)0x2000)            /* Bit 1 */

#define  DMA_CFGR10_MEM2MEM                          ((uint16_t)0x4000)            /* Memory to memory mode */

/*******************  Bit definition for DMA_CFGR11 register  *******************/
#define  DMA_CFGR11_EN                               ((uint16_t)0x0001)            /* Channel enable */
#define  DMA_CFGR11_TCIE                             ((uint16_t)0x0002)            /* Transfer complete interrupt enable */
#define  DMA_CFGR11_HTIE                             ((uint16_t)0x0004)            /* Half Transfer interrupt enable */
#define  DMA_CFGR11_TEIE                             ((uint16_t)0x0008)            /* Transfer error interrupt enable */
#define  DMA_CFGR11_DIR                              ((uint16_t)0x0010)            /* Data transfer direction */
#define  DMA_CFGR11_CIRC                             ((uint16_t)0x0020)            /* Circular mode */
#define  DMA_CFGR11_PINC                             ((uint16_t)0x0040)            /* Peripheral increment mode */
#define  DMA_CFGR11_MINC                             ((uint16_t)0x0080)            /* Memory increment mode */

#define  DMA_CFGR11_PSIZE                            ((uint16_t)0x0300)            /* PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CFGR11_PSIZE_0                          ((uint16_t)0x0100)            /* Bit 0 */
#define  DMA_CFGR11_PSIZE_1                          ((uint16_t)0x0200)            /* Bit 1 */

#define  DMA_CFGR11_MSIZE                            ((uint16_t)0x0C00)            /* MSIZE[1:0] bits (Memory size) */
#define  DMA_CFGR11_MSIZE_0                          ((uint16_t)0x0400)            /* Bit 0 */
#define  DMA_CFGR11_MSIZE_1                          ((uint16_t)0x0800)            /* Bit 1 */

#define  DMA_CFGR11_PL                               ((uint16_t)0x3000)            /* PL[1:0] bits (Channel Priority level) */
#define  DMA_CFGR11_PL_0                             ((uint16_t)0x1000)            /* Bit 0 */
#define  DMA_CFGR11_PL_1                             ((uint16_t)0x2000)            /* Bit 1 */

#define  DMA_CFGR11_MEM2MEM                          ((uint16_t)0x4000)            /* Memory to memory mode */

