XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Startup/ch32v4x7.h
/*******************  Bit definition for DMA_CFGR12 register  *******************/
#define  DMA_CFGR12_EN                               ((uint16_t)0x0001)            /* Channel enable */
#define  DMA_CFGR12_TCIE                             ((uint16_t)0x0002)            /* Transfer complete interrupt enable */
#define  DMA_CFGR12_HTIE                             ((uint16_t)0x0004)            /* Half Transfer interrupt enable */
#define  DMA_CFGR12_TEIE                             ((uint16_t)0x0008)            /* Transfer error interrupt enable */
#define  DMA_CFGR12_DIR                              ((uint16_t)0x0010)            /* Data transfer direction */
#define  DMA_CFGR12_CIRC                             ((uint16_t)0x0020)            /* Circular mode */
#define  DMA_CFGR12_PINC                             ((uint16_t)0x0040)            /* Peripheral increment mode */
#define  DMA_CFGR12_MINC                             ((uint16_t)0x0080)            /* Memory increment mode */

#define  DMA_CFGR12_PSIZE                            ((uint16_t)0x0300)            /* PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CFGR12_PSIZE_0                          ((uint16_t)0x0100)            /* Bit 0 */
#define  DMA_CFGR12_PSIZE_1                          ((uint16_t)0x0200)            /* Bit 1 */

#define  DMA_CFGR12_MSIZE                            ((uint16_t)0x0C00)            /* MSIZE[1:0] bits (Memory size) */
#define  DMA_CFGR12_MSIZE_0                          ((uint16_t)0x0400)            /* Bit 0 */
#define  DMA_CFGR12_MSIZE_1                          ((uint16_t)0x0800)            /* Bit 1 */

#define  DMA_CFGR12_PL                               ((uint16_t)0x3000)            /* PL[1:0] bits (Channel Priority level) */
#define  DMA_CFGR12_PL_0                             ((uint16_t)0x1000)            /* Bit 0 */
#define  DMA_CFGR12_PL_1                             ((uint16_t)0x2000)            /* Bit 1 */

#define  DMA_CFGR12_MEM2MEM                          ((uint16_t)0x4000)            /* Memory to memory mode */

/*******************  Bit definition for DMA_CFGR13 register  *******************/
#define  DMA_CFGR13_EN                               ((uint16_t)0x0001)            /* Channel enable */
#define  DMA_CFGR13_TCIE                             ((uint16_t)0x0002)            /* Transfer complete interrupt enable */
#define  DMA_CFGR13_HTIE                             ((uint16_t)0x0004)            /* Half Transfer interrupt enable */
#define  DMA_CFGR13_TEIE                             ((uint16_t)0x0008)            /* Transfer error interrupt enable */
#define  DMA_CFGR13_DIR                              ((uint16_t)0x0010)            /* Data transfer direction */
#define  DMA_CFGR13_CIRC                             ((uint16_t)0x0020)            /* Circular mode */
#define  DMA_CFGR13_PINC                             ((uint16_t)0x0040)            /* Peripheral increment mode */
#define  DMA_CFGR13_MINC                             ((uint16_t)0x0080)            /* Memory increment mode */

#define  DMA_CFGR13_PSIZE                            ((uint16_t)0x0300)            /* PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CFGR13_PSIZE_0                          ((uint16_t)0x0100)            /* Bit 0 */
#define  DMA_CFGR13_PSIZE_1                          ((uint16_t)0x0200)            /* Bit 1 */

#define  DMA_CFGR13_MSIZE                            ((uint16_t)0x0C00)            /* MSIZE[1:0] bits (Memory size) */
#define  DMA_CFGR13_MSIZE_0                          ((uint16_t)0x0400)            /* Bit 0 */
#define  DMA_CFGR13_MSIZE_1                          ((uint16_t)0x0800)            /* Bit 1 */

#define  DMA_CFGR13_PL                               ((uint16_t)0x3000)            /* PL[1:0] bits (Channel Priority level) */
#define  DMA_CFGR13_PL_0                             ((uint16_t)0x1000)            /* Bit 0 */
#define  DMA_CFGR13_PL_1                             ((uint16_t)0x2000)            /* Bit 1 */

#define  DMA_CFGR13_MEM2MEM                          ((uint16_t)0x4000)            /* Memory to memory mode */

/******************  Bit definition for DMA_CNTR1 register  ******************/
#define  DMA_CNTR1_NDT                               ((uint16_t)0xFFFF)            /* Number of data to Transfer */

/******************  Bit definition for DMA_CNTR2 register  ******************/
#define  DMA_CNTR2_NDT                               ((uint16_t)0xFFFF)            /* Number of data to Transfer */

/******************  Bit definition for DMA_CNTR3 register  ******************/
#define  DMA_CNTR3_NDT                               ((uint16_t)0xFFFF)            /* Number of data to Transfer */

/******************  Bit definition for DMA_CNTR4 register  ******************/
#define  DMA_CNTR4_NDT                               ((uint16_t)0xFFFF)            /* Number of data to Transfer */

/******************  Bit definition for DMA_CNTR5 register  ******************/
#define  DMA_CNTR5_NDT                               ((uint16_t)0xFFFF)            /* Number of data to Transfer */

/******************  Bit definition for DMA_CNTR6 register  ******************/
#define  DMA_CNTR6_NDT                               ((uint16_t)0xFFFF)            /* Number of data to Transfer */

/******************  Bit definition for DMA_CNTR7 register  ******************/
#define  DMA_CNTR7_NDT                               ((uint16_t)0xFFFF)            /* Number of data to Transfer */

/******************  Bit definition for DMA_CNTR8 register  ******************/
#define  DMA_CNTR8_NDT                               ((uint16_t)0xFFFF)            /* Number of data to Transfer */

/******************  Bit definition for DMA_CNTR9 register  ******************/
#define  DMA_CNTR9_NDT                               ((uint16_t)0xFFFF)            /* Number of data to Transfer */

/******************  Bit definition for DMA_CNTR10 register  ******************/
#define  DMA_CNTR10_NDT                              ((uint16_t)0xFFFF)            /* Number of data to Transfer */

/******************  Bit definition for DMA_CNTR11 register  ******************/
#define  DMA_CNTR11_NDT                              ((uint16_t)0xFFFF)            /* Number of data to Transfer */

