XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Startup/ch32v4x7.h
/*******************  Bit definition for DMA_EXTEM INTFCR register  *******************/
#define  DMA_CGIF9                                   ((uint32_t)0x00000001)        /* Channel 9 Global interrupt clear */
#define  DMA_CTCIF9                                  ((uint32_t)0x00000002)        /* Channel 9 Transfer Complete clear */
#define  DMA_CHTIF9                                  ((uint32_t)0x00000004)        /* Channel 9 Half Transfer clear */
#define  DMA_CTEIF9                                  ((uint32_t)0x00000008)        /* Channel 9 Transfer Error clear */
#define  DMA_CGIF10                                  ((uint32_t)0x00000010)        /* Channel 10 Global interrupt clear */
#define  DMA_CTCIF10                                 ((uint32_t)0x00000020)        /* Channel 10 Transfer Complete clear */
#define  DMA_CHTIF10                                 ((uint32_t)0x00000040)        /* Channel 10 Half Transfer clear */
#define  DMA_CTEIF10                                 ((uint32_t)0x00000080)        /* Channel 10 Transfer Error clear */
#define  DMA_CGIF11                                  ((uint32_t)0x00000100)        /* Channel 11 Global interrupt clear */
#define  DMA_CTCIF11                                 ((uint32_t)0x00000200)        /* Channel 11 Transfer Complete clear */
#define  DMA_CHTIF11                                 ((uint32_t)0x00000400)        /* Channel 11 Half Transfer clear */
#define  DMA_CTEIF11                                 ((uint32_t)0x00000800)        /* Channel 11 Transfer Error clear */
#define  DMA_CGIF12                                  ((uint32_t)0x00001000)        /* Channel 12 Global interrupt clear */
#define  DMA_CTCIF12                                 ((uint32_t)0x00002000)        /* Channel 12 Transfer Complete clear */
#define  DMA_CHTIF12                                 ((uint32_t)0x00004000)        /* Channel 12 Half Transfer clear */
#define  DMA_CTEIF12                                 ((uint32_t)0x00008000)        /* Channel 12 Transfer Error clear */
#define  DMA_CGIF13                                  ((uint32_t)0x00010000)        /* Channel 13 Global interrupt clear */
#define  DMA_CTCIF13                                 ((uint32_t)0x00020000)        /* Channel 13 Transfer Complete clear */
#define  DMA_CHTIF13                                 ((uint32_t)0x00040000)        /* Channel 13 Half Transfer clear */
#define  DMA_CTEIF13                                 ((uint32_t)0x00080000)        /* Channel 13 Transfer Error clear */

/******************************************************************************/
/*                    External Interrupt/Event Controller                     */
/******************************************************************************/

/*******************  Bit definition for EXTI_INTENR register  *******************/
#define  EXTI_INTENR_MR0                             ((uint32_t)0x00000001)        /* Interrupt Mask on line 0 */
#define  EXTI_INTENR_MR1                             ((uint32_t)0x00000002)        /* Interrupt Mask on line 1 */
#define  EXTI_INTENR_MR2                             ((uint32_t)0x00000004)        /* Interrupt Mask on line 2 */
#define  EXTI_INTENR_MR3                             ((uint32_t)0x00000008)        /* Interrupt Mask on line 3 */
#define  EXTI_INTENR_MR4                             ((uint32_t)0x00000010)        /* Interrupt Mask on line 4 */
#define  EXTI_INTENR_MR5                             ((uint32_t)0x00000020)        /* Interrupt Mask on line 5 */
#define  EXTI_INTENR_MR6                             ((uint32_t)0x00000040)        /* Interrupt Mask on line 6 */
#define  EXTI_INTENR_MR7                             ((uint32_t)0x00000080)        /* Interrupt Mask on line 7 */
#define  EXTI_INTENR_MR8                             ((uint32_t)0x00000100)        /* Interrupt Mask on line 8 */
#define  EXTI_INTENR_MR9                             ((uint32_t)0x00000200)        /* Interrupt Mask on line 9 */
#define  EXTI_INTENR_MR10                            ((uint32_t)0x00000400)        /* Interrupt Mask on line 10 */
#define  EXTI_INTENR_MR11                            ((uint32_t)0x00000800)        /* Interrupt Mask on line 11 */
#define  EXTI_INTENR_MR12                            ((uint32_t)0x00001000)        /* Interrupt Mask on line 12 */
#define  EXTI_INTENR_MR13                            ((uint32_t)0x00002000)        /* Interrupt Mask on line 13 */
#define  EXTI_INTENR_MR14                            ((uint32_t)0x00004000)        /* Interrupt Mask on line 14 */
#define  EXTI_INTENR_MR15                            ((uint32_t)0x00008000)        /* Interrupt Mask on line 15 */
#define  EXTI_INTENR_MR16                            ((uint32_t)0x00010000)        /* Interrupt Mask on line 16 */
#define  EXTI_INTENR_MR17                            ((uint32_t)0x00020000)        /* Interrupt Mask on line 17 */
#define  EXTI_INTENR_MR18                            ((uint32_t)0x00040000)        /* Interrupt Mask on line 18 */
#define  EXTI_INTENR_MR19                            ((uint32_t)0x00080000)        /* Interrupt Mask on line 19 */
#define  EXTI_INTENR_MR20                            ((uint32_t)0x00100000)        /* Interrupt Mask on line 20 */
#define  EXTI_INTENR_MR21                            ((uint32_t)0x00200000)        /* Interrupt Mask on line 21 */

/*******************  Bit definition for EXTI_EVENR register  *******************/
#define  EXTI_EVENR_MR0                              ((uint32_t)0x00000001)        /* Event Mask on line 0 */
#define  EXTI_EVENR_MR1                              ((uint32_t)0x00000002)        /* Event Mask on line 1 */
#define  EXTI_EVENR_MR2                              ((uint32_t)0x00000004)        /* Event Mask on line 2 */
#define  EXTI_EVENR_MR3                              ((uint32_t)0x00000008)        /* Event Mask on line 3 */
#define  EXTI_EVENR_MR4                              ((uint32_t)0x00000010)        /* Event Mask on line 4 */
#define  EXTI_EVENR_MR5                              ((uint32_t)0x00000020)        /* Event Mask on line 5 */
#define  EXTI_EVENR_MR6                              ((uint32_t)0x00000040)        /* Event Mask on line 6 */
#define  EXTI_EVENR_MR7                              ((uint32_t)0x00000080)        /* Event Mask on line 7 */
#define  EXTI_EVENR_MR8                              ((uint32_t)0x00000100)        /* Event Mask on line 8 */
#define  EXTI_EVENR_MR9                              ((uint32_t)0x00000200)        /* Event Mask on line 9 */
#define  EXTI_EVENR_MR10                             ((uint32_t)0x00000400)        /* Event Mask on line 10 */
#define  EXTI_EVENR_MR11                             ((uint32_t)0x00000800)        /* Event Mask on line 11 */
#define  EXTI_EVENR_MR12                             ((uint32_t)0x00001000)        /* Event Mask on line 12 */
#define  EXTI_EVENR_MR13                             ((uint32_t)0x00002000)        /* Event Mask on line 13 */
#define  EXTI_EVENR_MR14                             ((uint32_t)0x00004000)        /* Event Mask on line 14 */
#define  EXTI_EVENR_MR15                             ((uint32_t)0x00008000)        /* Event Mask on line 15 */
#define  EXTI_EVENR_MR16                             ((uint32_t)0x00010000)        /* Event Mask on line 16 */
#define  EXTI_EVENR_MR17                             ((uint32_t)0x00020000)        /* Event Mask on line 17 */
#define  EXTI_EVENR_MR18                             ((uint32_t)0x00040000)        /* Event Mask on line 18 */
#define  EXTI_EVENR_MR19                             ((uint32_t)0x00080000)        /* Event Mask on line 19 */
#define  EXTI_EVENR_MR20                             ((uint32_t)0x00100000)        /* Event Mask on line 20 */
#define  EXTI_EVENR_MR21                             ((uint32_t)0x00200000)        /* Event Mask on line 21 */

