XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Startup/ch32v4x7.h
#define  AFIO_PCFR1_USART3_REMAP                     ((uint32_t)0x00000030)        /* USART3_REMAP[1:0] bits (USART3 remapping) */
#define  AFIO_PCFR1_USART3_REMAP_0                   ((uint32_t)0x00000010)        /* Bit 0 */
#define  AFIO_PCFR1_USART3_REMAP_1                   ((uint32_t)0x00000020)        /* Bit 1 */

#define  AFIO_PCFR1_USART3_REMAP_NOREMAP             ((uint32_t)0x00000000)        /* No remap (TX/PB10, RX/PB11, CK/PB12, CTS/PB13, RTS/PB14) */
#define  AFIO_PCFR1_USART3_REMAP_PARTIALREMAP1       ((uint32_t)0x00000010)        /* Partial remap (TX/PC10, RX/PC11, CK/PC12, CTS/PB13, RTS/PB14) */
#define  AFIO_PCFR1_USART3_REMAP_PARTIALREMAP2       ((uint32_t)0x00000020)
#define  AFIO_PCFR1_USART3_REMAP_FULLREMAP           ((uint32_t)0x00000030)        /* Full remap (TX/PD8, RX/PD9, CK/PD10, CTS/PD11, RTS/PD12) */

#define  AFIO_PCFR1_TIM1_REMAP                       ((uint32_t)0x000000C0)        /* TIM1_REMAP[1:0] bits (TIM1 remapping) */
#define  AFIO_PCFR1_TIM1_REMAP_0                     ((uint32_t)0x00000040)        /* Bit 0 */
#define  AFIO_PCFR1_TIM1_REMAP_1                     ((uint32_t)0x00000080)        /* Bit 1 */

#define  AFIO_PCFR1_TIM1_REMAP_NOREMAP               ((uint32_t)0x00000000)        /* No remap (ETR/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BKIN/PB12, CH1N/PB13, CH2N/PB14, CH3N/PB15) */
#define  AFIO_PCFR1_TIM1_REMAP_PARTIALREMAP          ((uint32_t)0x00000040)        /* Partial remap (ETR/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BKIN/PA6, CH1N/PA7, CH2N/PB0, CH3N/PB1) */
#define  AFIO_PCFR1_TIM1_REMAP_FULLREMAP             ((uint32_t)0x000000C0)        /* Full remap (ETR/PE7, CH1/PE9, CH2/PE11, CH3/PE13, CH4/PE14, BKIN/PE15, CH1N/PE8, CH2N/PE10, CH3N/PE12) */

#define  AFIO_PCFR1_TIM2_REMAP                       ((uint32_t)0x00000300)        /* TIM2_REMAP[1:0] bits (TIM2 remapping) */
#define  AFIO_PCFR1_TIM2_REMAP_0                     ((uint32_t)0x00000100)        /* Bit 0 */
#define  AFIO_PCFR1_TIM2_REMAP_1                     ((uint32_t)0x00000200)        /* Bit 1 */

#define  AFIO_PCFR1_TIM2_REMAP_NOREMAP               ((uint32_t)0x00000000)        /* No remap (CH1/ETR/PA0, CH2/PA1, CH3/PA2, CH4/PA3) */
#define  AFIO_PCFR1_TIM2_REMAP_PARTIALREMAP1         ((uint32_t)0x00000100)        /* Partial remap (CH1/ETR/PA15, CH2/PB3, CH3/PA2, CH4/PA3) */
#define  AFIO_PCFR1_TIM2_REMAP_PARTIALREMAP2         ((uint32_t)0x00000200)        /* Partial remap (CH1/ETR/PA0, CH2/PA1, CH3/PB10, CH4/PB11) */
#define  AFIO_PCFR1_TIM2_REMAP_FULLREMAP             ((uint32_t)0x00000300)        /* Full remap (CH1/ETR/PA15, CH2/PB3, CH3/PB10, CH4/PB11) */

#define  AFIO_PCFR1_TIM3_REMAP                       ((uint32_t)0x00000C00)        /* TIM3_REMAP[1:0] bits (TIM3 remapping) */
#define  AFIO_PCFR1_TIM3_REMAP_0                     ((uint32_t)0x00000400)        /* Bit 0 */
#define  AFIO_PCFR1_TIM3_REMAP_1                     ((uint32_t)0x00000800)        /* Bit 1 */

#define  AFIO_PCFR1_TIM3_REMAP_NOREMAP               ((uint32_t)0x00000000)        /* No remap (CH1/PA6, CH2/PA7, CH3/PB0, CH4/PB1) */
#define  AFIO_PCFR1_TIM3_REMAP_PARTIALREMAP          ((uint32_t)0x00000800)        /* Partial remap (CH1/PB4, CH2/PB5, CH3/PB0, CH4/PB1) */
#define  AFIO_PCFR1_TIM3_REMAP_FULLREMAP             ((uint32_t)0x00000C00)        /* Full remap (CH1/PC6, CH2/PC7, CH3/PC8, CH4/PC9) */

#define  AFIO_PCFR1_TIM4_REMAP                       ((uint32_t)0x00001000)        /* TIM4_REMAP bit (TIM4 remapping) */

#define  AFIO_PCFR1_CAN_REMAP                        ((uint32_t)0x00006000)        /* CAN_REMAP[1:0] bits (CAN Alternate function remapping) */
#define  AFIO_PCFR1_CAN_REMAP_0                      ((uint32_t)0x00002000)        /* Bit 0 */
#define  AFIO_PCFR1_CAN_REMAP_1                      ((uint32_t)0x00004000)        /* Bit 1 */

#define  AFIO_PCFR1_CAN_REMAP_REMAP1                 ((uint32_t)0x00000000)        /* CANRX mapped to PA11, CANTX mapped to PA12 */
#define  AFIO_PCFR1_CAN_REMAP_REMAP2                 ((uint32_t)0x00004000)        /* CANRX mapped to PB8, CANTX mapped to PB9 */
#define  AFIO_PCFR1_CAN_REMAP_REMAP3                 ((uint32_t)0x00006000)        /* CANRX mapped to PD0, CANTX mapped to PD1 */

#define  AFIO_PCFR1_PD01_REMAP                       ((uint32_t)0x00008000)        /* Port D0/Port D1 mapping on OSC_IN/OSC_OUT */
#define  AFIO_PCFR1_TIM5CH4_IREMAP                   ((uint32_t)0x00010000)        /* TIM5 Channel4 Internal Remap */
#define  AFIO_PCFR1_ADC1_ETRGINJ_REMAP               ((uint32_t)0x00020000)        /* ADC 1 External Trigger Injected Conversion remapping */
#define  AFIO_PCFR1_ADC1_ETRGREG_REMAP               ((uint32_t)0x00040000)        /* ADC 1 External Trigger Regular Conversion remapping */
#define  AFIO_PCFR1_ADC2_ETRGINJ_REMAP               ((uint32_t)0x00080000)        /* ADC 2 External Trigger Injected Conversion remapping */
#define  AFIO_PCFR1_ADC2_ETRGREG_REMAP               ((uint32_t)0x00100000)        /* ADC 2 External Trigger Regular Conversion remapping */

#define  AFIO_PCFR1_SW_CFG                           ((uint32_t)0x07000000)        /* SW_CFG[2:0] bits (SDI configuration) */
#define  AFIO_PCFR1_SW_CFG_0                         ((uint32_t)0x01000000)        /* Bit 0 */
#define  AFIO_PCFR1_SW_CFG_1                         ((uint32_t)0x02000000)        /* Bit 1 */
#define  AFIO_PCFR1_SW_CFG_2                         ((uint32_t)0x04000000)        /* Bit 2 */

#define  AFIO_PCFR1_SW_CFG_ENABLE                    ((uint32_t)0x00000000)        /* SDI Enabled */
#define  AFIO_PCFR1_SW_CFG_DISABLE                   ((uint32_t)0x04000000)        /* SDI Disabled  */

#define  AFIO_PCFR1_SPI3_REMAP                       ((uint32_t)0x10000000)
#define  AFIO_PCFR1_TIM2ITR1_REMAP                   ((uint32_t)0x20000000)
#define  AFIO_PCFR1_PTP_PPS_REMAP                    ((uint32_t)0x40000000)
#define  AFIO_PCFR1_ETHPHY_LED_REMAP                 ((uint32_t)0x80000000)

/*****************  Bit definition for AFIO_EXTICR1 register  *****************/
#define  AFIO_EXTICR1_EXTI0                          ((uint16_t)0x000F)            /* EXTI 0 configuration */
#define  AFIO_EXTICR1_EXTI1                          ((uint16_t)0x00F0)            /* EXTI 1 configuration */
#define  AFIO_EXTICR1_EXTI2                          ((uint16_t)0x0F00)            /* EXTI 2 configuration */
#define  AFIO_EXTICR1_EXTI3                          ((uint16_t)0xF000)            /* EXTI 3 configuration */

#define  AFIO_EXTICR1_EXTI0_PA                       ((uint16_t)0x0000)            /* PA[0] pin */
#define  AFIO_EXTICR1_EXTI0_PB                       ((uint16_t)0x0001)            /* PB[0] pin */
#define  AFIO_EXTICR1_EXTI0_PC                       ((uint16_t)0x0002)            /* PC[0] pin */
#define  AFIO_EXTICR1_EXTI0_PD                       ((uint16_t)0x0003)            /* PD[0] pin */
#define  AFIO_EXTICR1_EXTI0_PE                       ((uint16_t)0x0004)            /* PE[0] pin */
 
#define  AFIO_EXTICR1_EXTI1_PA                       ((uint16_t)0x0000)            /* PA[1] pin */
#define  AFIO_EXTICR1_EXTI1_PB                       ((uint16_t)0x0010)            /* PB[1] pin */
#define  AFIO_EXTICR1_EXTI1_PC                       ((uint16_t)0x0020)            /* PC[1] pin */
#define  AFIO_EXTICR1_EXTI1_PD                       ((uint16_t)0x0030)            /* PD[1] pin */
#define  AFIO_EXTICR1_EXTI1_PE                       ((uint16_t)0x0040)            /* PE[1] pin */
 
#define  AFIO_EXTICR1_EXTI2_PA                       ((uint16_t)0x0000)            /* PA[2] pin */
#define  AFIO_EXTICR1_EXTI2_PB                       ((uint16_t)0x0100)            /* PB[2] pin */
#define  AFIO_EXTICR1_EXTI2_PC                       ((uint16_t)0x0200)            /* PC[2] pin */
#define  AFIO_EXTICR1_EXTI2_PD                       ((uint16_t)0x0300)            /* PD[2] pin */
#define  AFIO_EXTICR1_EXTI2_PE                       ((uint16_t)0x0400)            /* PE[2] pin */

#define  AFIO_EXTICR1_EXTI3_PA                       ((uint16_t)0x0000)            /* PA[3] pin */
#define  AFIO_EXTICR1_EXTI3_PB                       ((uint16_t)0x1000)            /* PB[3] pin */
#define  AFIO_EXTICR1_EXTI3_PC                       ((uint16_t)0x2000)            /* PC[3] pin */
#define  AFIO_EXTICR1_EXTI3_PD                       ((uint16_t)0x3000)            /* PD[3] pin */
#define  AFIO_EXTICR1_EXTI3_PE                       ((uint16_t)0x4000)            /* PE[3] pin */

/*****************  Bit definition for AFIO_EXTICR2 register  *****************/
#define  AFIO_EXTICR2_EXTI4                          ((uint16_t)0x000F)            /* EXTI 4 configuration */
#define  AFIO_EXTICR2_EXTI5                          ((uint16_t)0x00F0)            /* EXTI 5 configuration */
#define  AFIO_EXTICR2_EXTI6                          ((uint16_t)0x0F00)            /* EXTI 6 configuration */
#define  AFIO_EXTICR2_EXTI7                          ((uint16_t)0xF000)            /* EXTI 7 configuration */

#define  AFIO_EXTICR2_EXTI4_PA                       ((uint16_t)0x0000)            /* PA[4] pin */
#define  AFIO_EXTICR2_EXTI4_PB                       ((uint16_t)0x0001)            /* PB[4] pin */
#define  AFIO_EXTICR2_EXTI4_PC                       ((uint16_t)0x0002)            /* PC[4] pin */
#define  AFIO_EXTICR2_EXTI4_PD                       ((uint16_t)0x0003)            /* PD[4] pin */
#define  AFIO_EXTICR2_EXTI4_PE                       ((uint16_t)0x0004)            /* PE[4] pin */

