XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Startup/ch32v4x7.h
#define  AFIO_EXTICR2_EXTI5_PA                       ((uint16_t)0x0000)            /* PA[5] pin */
#define  AFIO_EXTICR2_EXTI5_PB                       ((uint16_t)0x0010)            /* PB[5] pin */
#define  AFIO_EXTICR2_EXTI5_PC                       ((uint16_t)0x0020)            /* PC[5] pin */
#define  AFIO_EXTICR2_EXTI5_PD                       ((uint16_t)0x0030)            /* PD[5] pin */
#define  AFIO_EXTICR2_EXTI5_PE                       ((uint16_t)0x0040)            /* PE[5] pin */

#define  AFIO_EXTICR2_EXTI6_PA                       ((uint16_t)0x0000)            /* PA[6] pin */
#define  AFIO_EXTICR2_EXTI6_PB                       ((uint16_t)0x0100)            /* PB[6] pin */
#define  AFIO_EXTICR2_EXTI6_PC                       ((uint16_t)0x0200)            /* PC[6] pin */
#define  AFIO_EXTICR2_EXTI6_PD                       ((uint16_t)0x0300)            /* PD[6] pin */
#define  AFIO_EXTICR2_EXTI6_PE                       ((uint16_t)0x0400)            /* PE[6] pin */

#define  AFIO_EXTICR2_EXTI7_PA                       ((uint16_t)0x0000)            /* PA[7] pin */
#define  AFIO_EXTICR2_EXTI7_PB                       ((uint16_t)0x1000)            /* PB[7] pin */
#define  AFIO_EXTICR2_EXTI7_PC                       ((uint16_t)0x2000)            /* PC[7] pin */
#define  AFIO_EXTICR2_EXTI7_PD                       ((uint16_t)0x3000)            /* PD[7] pin */
#define  AFIO_EXTICR2_EXTI7_PE                       ((uint16_t)0x4000)            /* PE[7] pin */

/*****************  Bit definition for AFIO_EXTICR3 register  *****************/
#define  AFIO_EXTICR3_EXTI8                          ((uint16_t)0x000F)            /* EXTI 8 configuration */
#define  AFIO_EXTICR3_EXTI9                          ((uint16_t)0x00F0)            /* EXTI 9 configuration */
#define  AFIO_EXTICR3_EXTI10                         ((uint16_t)0x0F00)            /* EXTI 10 configuration */
#define  AFIO_EXTICR3_EXTI11                         ((uint16_t)0xF000)            /* EXTI 11 configuration */

#define  AFIO_EXTICR3_EXTI8_PA                       ((uint16_t)0x0000)            /* PA[8] pin */
#define  AFIO_EXTICR3_EXTI8_PB                       ((uint16_t)0x0001)            /* PB[8] pin */
#define  AFIO_EXTICR3_EXTI8_PC                       ((uint16_t)0x0002)            /* PC[8] pin */
#define  AFIO_EXTICR3_EXTI8_PD                       ((uint16_t)0x0003)            /* PD[8] pin */
#define  AFIO_EXTICR3_EXTI8_PE                       ((uint16_t)0x0004)            /* PE[8] pin */

#define  AFIO_EXTICR3_EXTI9_PA                       ((uint16_t)0x0000)            /* PA[9] pin */
#define  AFIO_EXTICR3_EXTI9_PB                       ((uint16_t)0x0010)            /* PB[9] pin */
#define  AFIO_EXTICR3_EXTI9_PC                       ((uint16_t)0x0020)            /* PC[9] pin */
#define  AFIO_EXTICR3_EXTI9_PD                       ((uint16_t)0x0030)            /* PD[9] pin */
#define  AFIO_EXTICR3_EXTI9_PE                       ((uint16_t)0x0040)            /* PE[9] pin */

#define  AFIO_EXTICR3_EXTI10_PA                      ((uint16_t)0x0000)            /* PA[10] pin */
#define  AFIO_EXTICR3_EXTI10_PB                      ((uint16_t)0x0100)            /* PB[10] pin */
#define  AFIO_EXTICR3_EXTI10_PC                      ((uint16_t)0x0200)            /* PC[10] pin */
#define  AFIO_EXTICR3_EXTI10_PD                      ((uint16_t)0x0300)            /* PD[10] pin */
#define  AFIO_EXTICR3_EXTI10_PE                      ((uint16_t)0x0400)            /* PE[10] pin */

#define  AFIO_EXTICR3_EXTI11_PA                      ((uint16_t)0x0000)            /* PA[11] pin */
#define  AFIO_EXTICR3_EXTI11_PB                      ((uint16_t)0x1000)            /* PB[11] pin */
#define  AFIO_EXTICR3_EXTI11_PC                      ((uint16_t)0x2000)            /* PC[11] pin */
#define  AFIO_EXTICR3_EXTI11_PD                      ((uint16_t)0x3000)            /* PD[11] pin */
#define  AFIO_EXTICR3_EXTI11_PE                      ((uint16_t)0x4000)            /* PE[11] pin */

/*****************  Bit definition for AFIO_EXTICR4 register  *****************/
#define  AFIO_EXTICR4_EXTI12                         ((uint16_t)0x000F)            /* EXTI 12 configuration */
#define  AFIO_EXTICR4_EXTI13                         ((uint16_t)0x00F0)            /* EXTI 13 configuration */
#define  AFIO_EXTICR4_EXTI14                         ((uint16_t)0x0F00)            /* EXTI 14 configuration */
#define  AFIO_EXTICR4_EXTI15                         ((uint16_t)0xF000)            /* EXTI 15 configuration */

#define  AFIO_EXTICR4_EXTI12_PA                      ((uint16_t)0x0000)            /* PA[12] pin */
#define  AFIO_EXTICR4_EXTI12_PB                      ((uint16_t)0x0001)            /* PB[12] pin */
#define  AFIO_EXTICR4_EXTI12_PC                      ((uint16_t)0x0002)            /* PC[12] pin */
#define  AFIO_EXTICR4_EXTI12_PD                      ((uint16_t)0x0003)            /* PD[12] pin */
#define  AFIO_EXTICR4_EXTI12_PE                      ((uint16_t)0x0004)            /* PE[12] pin */

#define  AFIO_EXTICR4_EXTI13_PA                      ((uint16_t)0x0000)            /* PA[13] pin */
#define  AFIO_EXTICR4_EXTI13_PB                      ((uint16_t)0x0010)            /* PB[13] pin */
#define  AFIO_EXTICR4_EXTI13_PC                      ((uint16_t)0x0020)            /* PC[13] pin */
#define  AFIO_EXTICR4_EXTI13_PD                      ((uint16_t)0x0030)            /* PD[13] pin */
#define  AFIO_EXTICR4_EXTI13_PE                      ((uint16_t)0x0040)            /* PE[13] pin */

#define  AFIO_EXTICR4_EXTI14_PA                      ((uint16_t)0x0000)            /* PA[14] pin */
#define  AFIO_EXTICR4_EXTI14_PB                      ((uint16_t)0x0100)            /* PB[14] pin */
#define  AFIO_EXTICR4_EXTI14_PC                      ((uint16_t)0x0200)            /* PC[14] pin */
#define  AFIO_EXTICR4_EXTI14_PD                      ((uint16_t)0x0300)            /* PD[14] pin */
#define  AFIO_EXTICR4_EXTI14_PE                      ((uint16_t)0x0400)            /* PE[14] pin *//

#define  AFIO_EXTICR4_EXTI15_PA                      ((uint16_t)0x0000)            /* PA[15] pin */
#define  AFIO_EXTICR4_EXTI15_PB                      ((uint16_t)0x1000)            /* PB[15] pin */
#define  AFIO_EXTICR4_EXTI15_PC                      ((uint16_t)0x2000)            /* PC[15] pin */
#define  AFIO_EXTICR4_EXTI15_PD                      ((uint16_t)0x3000)            /* PD[15] pin */
#define  AFIO_EXTICR4_EXTI15_PE                      ((uint16_t)0x4000)            /* PE[15] pin */

/******************  Bit definition for AFIO_PCFR2register  *******************/
#define  AFIO_PCFR2_FSMC_REMAP                       ((uint32_t)0x00000001)    
#define  AFIO_PCFR2_TIM8_REMAP                       ((uint32_t)0x00000004)        

#define  AFIO_PCFR2_FSMC_NADV_REMAP                  ((uint32_t)0x00000400)
#define  AFIO_PCFR2_LTDC_REMAP                       ((uint32_t)0x00000800)
#define  AFIO_PCFR2_SDIO_REMAP                       ((uint32_t)0x00001000)
#define  AFIO_PCFR2_DVP_REMAP                        ((uint32_t)0x00002000)
#define  AFIO_PCFR2_I3C_REMAP                        ((uint32_t)0x00004000)

