XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Startup/ch32v4x7.h
#define  AFIO_PCFR2_USART4_REMAP                     ((uint32_t)0x00030000)        
#define  AFIO_PCFR2_USART4_REMAP_0                   ((uint32_t)0x00010000)
#define  AFIO_PCFR2_USART4_REMAP_1                   ((uint32_t)0x00020000)

#define  AFIO_PCFR2_USART4_REMAP_NOREMAP             ((uint32_t)0x00000000)        
#define  AFIO_PCFR2_USART4_REMAP_PARTIALREMAP        ((uint32_t)0x00010000)        
#define  AFIO_PCFR2_USART4_REMAP_FULLREMAP           ((uint32_t)0x00020000)        

#define  AFIO_PCFR2_USART5_REMAP                     ((uint32_t)0x000C0000)        
#define  AFIO_PCFR2_USART5_REMAP_0                   ((uint32_t)0x00040000)
#define  AFIO_PCFR2_USART5_REMAP_1                   ((uint32_t)0x00080000)

#define  AFIO_PCFR2_USART5_REMAP_NOREMAP             ((uint32_t)0x00000000)        
#define  AFIO_PCFR2_USART5_REMAP_PARTIALREMAP        ((uint32_t)0x00040000)        
#define  AFIO_PCFR2_USART5_REMAP_FULLREMAP           ((uint32_t)0x00080000)        

#define  AFIO_PCFR2_USART6_REMAP                     ((uint32_t)0x00300000)        
#define  AFIO_PCFR2_USART6_REMAP_0                   ((uint32_t)0x00100000)
#define  AFIO_PCFR2_USART6_REMAP_1                   ((uint32_t)0x00200000)

#define  AFIO_PCFR2_USART6_REMAP_NOREMAP             ((uint32_t)0x00000000)        
#define  AFIO_PCFR2_USART6_REMAP_PARTIALREMAP1       ((uint32_t)0x00100000)        
#define  AFIO_PCFR2_USART6_REMAP_PARTIALREMAP2       ((uint32_t)0x00200000)     
#define  AFIO_PCFR2_USART6_REMAP_FULLREMAP           ((uint32_t)0x00300000)    

#define  AFIO_PCFR2_USART7_REMAP                     ((uint32_t)0x00C00000)        
#define  AFIO_PCFR2_USART7_REMAP_0                   ((uint32_t)0x00400000)
#define  AFIO_PCFR2_USART7_REMAP_1                   ((uint32_t)0x00800000)

#define  AFIO_PCFR2_USART7_REMAP_NOREMAP             ((uint32_t)0x00000000)        
#define  AFIO_PCFR2_USART7_REMAP_PARTIALREMAP1       ((uint32_t)0x00400000)   
#define  AFIO_PCFR2_USART7_REMAP_PARTIALREMAP2       ((uint32_t)0x00400000)        
#define  AFIO_PCFR2_USART7_REMAP_FULLREMAP           ((uint32_t)0x00800000)        

#define  AFIO_PCFR2_USART8_REMAP                     ((uint32_t)0x03000000)        
#define  AFIO_PCFR2_USART8_REMAP_0                   ((uint32_t)0x01000000)
#define  AFIO_PCFR2_USART8_REMAP_1                   ((uint32_t)0x02000000)

#define  AFIO_PCFR2_USART8_REMAP_NOREMAP             ((uint32_t)0x00000000)        
#define  AFIO_PCFR2_USART8_REMAP_PARTIALREMAP        ((uint32_t)0x01000000)        
#define  AFIO_PCFR2_USART8_REMAP_FULLREMAP           ((uint32_t)0x02000000)        

#define  AFIO_PCFR2_USART1_REMAP                     ((uint32_t)0x04000000)        

#define  AFIO_PCFR2_USART9_REMAP                     ((uint32_t)0x30000000)        
#define  AFIO_PCFR2_USART9_REMAP_0                   ((uint32_t)0x10000000)
#define  AFIO_PCFR2_USART9_REMAP_1                   ((uint32_t)0x20000000)

#define  AFIO_PCFR2_USART9_REMAP_NOREMAP             ((uint32_t)0x00000000)        
#define  AFIO_PCFR2_USART9_REMAP_PARTIALREMAP        ((uint32_t)0x10000000)        
#define  AFIO_PCFR2_USART9_REMAP_FULLREMAP           ((uint32_t)0x20000000)  

#define  AFIO_PCFR2_USART10_REMAP                    ((uint32_t)0xC0000000)        
#define  AFIO_PCFR2_USART10_REMAP_0                  ((uint32_t)0x40000000)
#define  AFIO_PCFR2_USART10_REMAP_1                  ((uint32_t)0x80000000)

#define  AFIO_PCFR2_USART10_REMAP_NOREMAP            ((uint32_t)0x00000000)        
#define  AFIO_PCFR2_USART10_REMAP_PARTIALREMAP       ((uint32_t)0x40000000)        
#define  AFIO_PCFR2_USART10_REMAP_FULLREMAP          ((uint32_t)0x80000000)  

/******************************************************************************/
/*                           Independent WATCHDOG                             */
/******************************************************************************/

/*******************  Bit definition for IWDG_CTLR register  ********************/
#define  IWDG_KEY                                    ((uint16_t)0xFFFF)            /* Key value (write only, read 0000h) */

/*******************  Bit definition for IWDG_PSCR register  ********************/
#define  IWDG_PR                                     ((uint8_t)0x07)               /* PR[2:0] (Prescaler divider) */
#define  IWDG_PR_0                                   ((uint8_t)0x01)               /* Bit 0 */
#define  IWDG_PR_1                                   ((uint8_t)0x02)               /* Bit 1 */
#define  IWDG_PR_2                                   ((uint8_t)0x04)               /* Bit 2 */

/*******************  Bit definition for IWDG_RLDR register  *******************/
#define  IWDG_RL                                     ((uint16_t)0x0FFF)            /* Watchdog counter reload value */

/*******************  Bit definition for IWDG_STATR register  ********************/
#define  IWDG_PVU                                    ((uint8_t)0x01)               /* Watchdog prescaler value update */
#define  IWDG_RVU                                    ((uint8_t)0x02)               /* Watchdog counter reload value update */

/******************************************************************************/
/*                      Inter-integrated Circuit Interface                    */
/******************************************************************************/

/*******************  Bit definition for I2C_CTLR1 register  ********************/
#define  I2C_CTLR1_PE                                ((uint16_t)0x0001)            /* Peripheral Enable */
#define  I2C_CTLR1_SMBUS                             ((uint16_t)0x0002)            /* SMBus Mode */
#define  I2C_CTLR1_SMBTYPE                           ((uint16_t)0x0008)            /* SMBus Type */
#define  I2C_CTLR1_ENARP                             ((uint16_t)0x0010)            /* ARP Enable */
#define  I2C_CTLR1_ENPEC                             ((uint16_t)0x0020)            /* PEC Enable */
#define  I2C_CTLR1_ENGC                              ((uint16_t)0x0040)            /* General Call Enable */
#define  I2C_CTLR1_NOSTRETCH                         ((uint16_t)0x0080)            /* Clock Stretching Disable (Slave mode) */
#define  I2C_CTLR1_START                             ((uint16_t)0x0100)            /* Start Generation */
#define  I2C_CTLR1_STOP                              ((uint16_t)0x0200)            /* Stop Generation */
#define  I2C_CTLR1_ACK                               ((uint16_t)0x0400)            /* Acknowledge Enable */
#define  I2C_CTLR1_POS                               ((uint16_t)0x0800)            /* Acknowledge/PEC Position (for data reception) */
#define  I2C_CTLR1_PEC                               ((uint16_t)0x1000)            /* Packet Error Checking */
#define  I2C_CTLR1_ALERT                             ((uint16_t)0x2000)            /* SMBus Alert */
#define  I2C_CTLR1_SWRST                             ((uint16_t)0x8000)            /* Software Reset */

/*******************  Bit definition for I2C_CTLR2 register  ********************/
#define  I2C_CTLR2_FREQ                              ((uint16_t)0x003F)            /* FREQ[5:0] bits (Peripheral Clock Frequency) */
#define  I2C_CTLR2_FREQ_0                            ((uint16_t)0x0001)            /* Bit 0 */
#define  I2C_CTLR2_FREQ_1                            ((uint16_t)0x0002)            /* Bit 1 */
#define  I2C_CTLR2_FREQ_2                            ((uint16_t)0x0004)            /* Bit 2 */
#define  I2C_CTLR2_FREQ_3                            ((uint16_t)0x0008)            /* Bit 3 */
#define  I2C_CTLR2_FREQ_4                            ((uint16_t)0x0010)            /* Bit 4 */
#define  I2C_CTLR2_FREQ_5                            ((uint16_t)0x0020)            /* Bit 5 */

#define  I2C_CTLR2_ITERREN                           ((uint16_t)0x0100)            /* Error Interrupt Enable */
#define  I2C_CTLR2_ITEVTEN                           ((uint16_t)0x0200)            /* Event Interrupt Enable */
#define  I2C_CTLR2_ITBUFEN                           ((uint16_t)0x0400)            /* Buffer Interrupt Enable */
#define  I2C_CTLR2_DMAEN                             ((uint16_t)0x0800)            /* DMA Requests Enable */
#define  I2C_CTLR2_LAST                              ((uint16_t)0x1000)            /* DMA Last Transfer */

/*******************  Bit definition for I2C_OADDR1 register  *******************/
#define  I2C_OADDR1_ADD0                             ((uint16_t)0x0001)
#define  I2C_OADDR1_ADD1_7                           ((uint16_t)0x00FE)            /* Interface Address */
#define  I2C_OADDR1_ADD8_9                           ((uint16_t)0x0300)            /* Interface Address */

#define  I2C_OADDR1_ADD0                             ((uint16_t)0x0001)            /* Bit 0 */
#define  I2C_OADDR1_ADD1                             ((uint16_t)0x0002)            /* Bit 1 */
#define  I2C_OADDR1_ADD2                             ((uint16_t)0x0004)            /* Bit 2 */
#define  I2C_OADDR1_ADD3                             ((uint16_t)0x0008)            /* Bit 3 */
#define  I2C_OADDR1_ADD4                             ((uint16_t)0x0010)            /* Bit 4 */
#define  I2C_OADDR1_ADD5                             ((uint16_t)0x0020)            /* Bit 5 */
#define  I2C_OADDR1_ADD6                             ((uint16_t)0x0040)            /* Bit 6 */
#define  I2C_OADDR1_ADD7                             ((uint16_t)0x0080)            /* Bit 7 */
#define  I2C_OADDR1_ADD8                             ((uint16_t)0x0100)            /* Bit 8 */
#define  I2C_OADDR1_ADD9                             ((uint16_t)0x0200)            /* Bit 9 */

#define  I2C_OADDR1_ADDMODE                          ((uint16_t)0x8000)            /* Addressing Mode (Slave mode) */

