XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Startup/ch32v4x7.h
/*******************  Bit definition for I3C_RESET register  ********************/
#define  I3C_RESET_HST_SIE_RST                       ((uint32_t)0x01000000)

/*******************  Bit definition for I3C_STATR register  ********************/
#define  I3C_STATR_XDCNT                             ((uint32_t)0x0000FFFF)
#define  I3C_STATR_ABT                               ((uint32_t)0x00020000)
#define  I3C_STATR_DIR                               ((uint32_t)0x00040000)

#define  I3C_STATR_MID                               ((uint32_t)0xFF000000)

/*******************  Bit definition for I3C_STATER register  ********************/
#define  I3C_STATER_CODERR                           ((uint32_t)0x0000000F)
#define  I3C_STATER_PERR                             ((uint32_t)0x00000010)
#define  I3C_STATER_STALL                            ((uint32_t)0x00000020)
#define  I3C_STATER_DOVR                             ((uint32_t)0x00000040)
#define  I3C_STATER_COVR                             ((uint32_t)0x00000080)
#define  I3C_STATER_ANACK                            ((uint32_t)0x00000100)
#define  I3C_STATER_DNACK                            ((uint32_t)0x00000200)
#define  I3C_STATER_DERR                             ((uint32_t)0x00000400)

/*******************  Bit definition for I3C_RMR register  ********************/
#define  I3C_RMR_IBIRDCNT                            ((uint32_t)0x00000007)
#define  I3C_RMR_RCODE                               ((uint32_t)0x0000FF00)
#define  I3C_RMR_RADD                                ((uint32_t)0x00FE0000)

/*******************  Bit definition for I3C_EVR register  ********************/
#define  I3C_EVR_CFEF                                ((uint32_t)0x00000001)
#define  I3C_EVR_TXFEF                               ((uint32_t)0x00000002)
#define  I3C_EVR_CFNFF                               ((uint32_t)0x00000004)

#define  I3C_EVR_TXFNFF                              ((uint32_t)0x00000010)
#define  I3C_EVR_RXFNEF                              ((uint32_t)0x00000020)
#define  I3C_EVR_TXLASTF                             ((uint32_t)0x00000040)
#define  I3C_EVR_RXLASTF                             ((uint32_t)0x00000080)

#define  I3C_EVR_FCF                                 ((uint32_t)0x00000200)
#define  I3C_EVR_RXTGTENDF                           ((uint32_t)0x00000400)
#define  I3C_EVR_ERRF                                ((uint32_t)0x00000800)

#define  I3C_EVR_IBIF                                ((uint32_t)0x00008000)
#define  I3C_EVR_HJF                                 ((uint32_t)0x00080000)

/*****************  Bit definition for I3C_INTENR register  ******************/
#define  I3C_INTENR_CFNFIE                           ((uint32_t)0x00000004)
#define  I3C_INTENR_TXFNEIE                          ((uint32_t)0x00000010)
#define  I3C_INTENR_RXFNEIE                          ((uint32_t)0x00000020)

#define  I3C_INTENR_FCIE                             ((uint32_t)0x00000200)
#define  I3C_INTENR_RXTGTENDIE                       ((uint32_t)0x00000400)
#define  I3C_INTENR_ERRIE                            ((uint32_t)0x00000800)

#define  I3C_INTENR_IBIIE                            ((uint32_t)0x00008000)
#define  I3C_INTENR_CRIE                             ((uint32_t)0x00020000)
#define  I3C_INTENR_HJIE                             ((uint32_t)0x00080000)

/*****************  Bit definition for I3C_CEVR register  ******************/
#define  I3C_CEVR_CFCR                               ((uint32_t)0x00000200)
#define  I3C_CEVR_CRXTGTENDF                         ((uint32_t)0x00000400)
#define  I3C_CEVR_CERRF                              ((uint32_t)0x00000800)

#define  I3C_CEVR_CIBIF                              ((uint32_t)0x00008000)
#define  I3C_CEVR_CHJF                               ((uint32_t)0x00080000)

/*****************  Bit definition for I3C_DEVR0 register  ******************/
#define  I3C_DEVR0_DAVAL                             ((uint32_t)0x00000001)
#define  I3C_DEVR0_DA                                ((uint32_t)0x000000FE)

/*****************  Bit definition for I3C_DEVR1 register  ******************/
#define  I3C_DEVR1_DA                                ((uint32_t)0x000000FE)

#define  I3C_DEVR1_IBIACK                            ((uint32_t)0x00010000)
#define  I3C_DEVR1_IBIDEN                            ((uint32_t)0x00040000)
#define  I3C_DEVR1_SUSP                              ((uint32_t)0x00080000)

#define  I3C_DEVR1_DIS                               ((uint32_t)0x80000000)

/*****************  Bit definition for I3C_DEVR2 register  ******************/
#define  I3C_DEVR2_DA                                ((uint32_t)0x000000FE)

#define  I3C_DEVR2_IBIACK                            ((uint32_t)0x00010000)
#define  I3C_DEVR2_IBIDEN                            ((uint32_t)0x00040000)
#define  I3C_DEVR2_SUSP                              ((uint32_t)0x00080000)

#define  I3C_DEVR2_DIS                               ((uint32_t)0x80000000)

/*****************  Bit definition for I3C_DEVR3 register  ******************/
#define  I3C_DEVR3_DA                                ((uint32_t)0x000000FE)

#define  I3C_DEVR3_IBIACK                            ((uint32_t)0x00010000)
#define  I3C_DEVR3_IBIDEN                            ((uint32_t)0x00040000)
#define  I3C_DEVR3_SUSP                              ((uint32_t)0x00080000)

#define  I3C_DEVR3_DIS                               ((uint32_t)0x80000000)

/*****************  Bit definition for I3C_DEVR4 register  ******************/
#define  I3C_DEVR4_DA                                ((uint32_t)0x000000FE)

#define  I3C_DEVR4_IBIACK                            ((uint32_t)0x00010000)
#define  I3C_DEVR4_IBIDEN                            ((uint32_t)0x00040000)
#define  I3C_DEVR4_SUSP                              ((uint32_t)0x00080000)

#define  I3C_DEVR4_DIS                               ((uint32_t)0x80000000)

/*****************  Bit definition for I3C_TIMINGR0 register  ******************/
#define  I3C_TIMINGR0_SCLL_PP                        ((uint32_t)0x000000FF)
#define  I3C_TIMINGR0_SCLH_I3C                       ((uint32_t)0x0000FF00)
#define  I3C_TIMINGR0_SCLL_OD                        ((uint32_t)0x00FF0000)
#define  I3C_TIMINGR0_SCLH_I2C                       ((uint32_t)0xFF000000)

/*****************  Bit definition for I3C_TIMINGR1 register  ******************/
#define  I3C_TIMINGR1_AVAL                           ((uint32_t)0x000000FF)
#define  I3C_TIMINGR1_ASNCR                          ((uint32_t)0x00000300)

#define  I3C_TIMINGR1_FREE                           ((uint32_t)0x007F0000)
#define  I3C_TIMINGR1_SDA_HD                         ((uint32_t)0x10000000)

/*****************  Bit definition for I3C_TIMINGR2 register  ******************/
#define  I3C_TIMINGR2_STALLT                         ((uint32_t)0x00000001)
#define  I3C_TIMINGR2_STALLD                         ((uint32_t)0x00000002)
#define  I3C_TIMINGR2_STALLC                         ((uint32_t)0x00000004)
#define  I3C_TIMINGR2_STALLA                         ((uint32_t)0x00000008)

