XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Startup/ch32v4x7.h
#define  I3C_TIMINGR2_STALL                          ((uint32_t)0x0000FF00)

/*****************  Bit definition for I3C_GETMDSR register  ******************/
#define  I3C_GETMDSR_TSCO                            ((uint32_t)0x01000000)

/******************************************************************************/
/*                             Power Control                                  */
/******************************************************************************/

/********************  Bit definition for PWR_CTLR register  ********************/
#define  PWR_CTLR_LPDS                               ((uint16_t)0x0001)     /* Low-Power Deepsleep */
#define  PWR_CTLR_PDDS                               ((uint16_t)0x0002)     /* Power Down Deepsleep */
#define  PWR_CTLR_CWUF                               ((uint16_t)0x0004)     /* Clear Wakeup Flag */
#define  PWR_CTLR_CSBF                               ((uint16_t)0x0008)     /* Clear Standby Flag */
#define  PWR_CTLR_PVDE                               ((uint16_t)0x0010)     /* Power Voltage Detector Enable */

#define  PWR_CTLR_PLS                                ((uint16_t)0x0060)     /* PLS[1:0] bits (PVD Level Selection) */
#define  PWR_CTLR_PLS_0                              ((uint16_t)0x0020)     /* Bit 0 */
#define  PWR_CTLR_PLS_1                              ((uint16_t)0x0040)     /* Bit 1 */

#define  PWR_CTLR_PLS_MODE0                          ((uint16_t)0x0000)     
#define  PWR_CTLR_PLS_MODE1                          ((uint16_t)0x0020)     
#define  PWR_CTLR_PLS_MODE2                          ((uint16_t)0x0040)     
#define  PWR_CTLR_PLS_MODE3                          ((uint16_t)0x0060)     

#define  PWR_CTLR_DBP                                ((uint16_t)0x0100)     /* Disable Backup Domain write protection */
#define  PWR_CTLR_LDO18_EN                           ((uint16_t)0x0200)

#define  PWR_CTLR_R32KSTY                            ((uint32_t)0x00010000)
#define  PWR_CTLR_R32KVBAT                           ((uint32_t)0x00040000)

#define  PWR_CTLR_RAMLV                              ((uint32_t)0x00100000)

#define  PWR_CTLR_LDOVDDK                            ((uint32_t)0x07000000)
#define  PWR_CTLR_LDOVDD12A                          ((uint32_t)0x38000000)

/*******************  Bit definition for PWR_CSR register  ********************/
#define  PWR_CSR_WUF                                 ((uint16_t)0x0001)     /* Wakeup Flag */
#define  PWR_CSR_SBF                                 ((uint16_t)0x0002)     /* Standby Flag */
#define  PWR_CSR_PVDO                                ((uint16_t)0x0004)     /* PVD Output */
#define  PWR_CSR_EWUP                                ((uint16_t)0x0100)     /* Enable WKUP pin */

/******************************************************************************/
/*                         Reset and Clock Control                            */
/******************************************************************************/

/********************  Bit definition for RCC_CTLR register  ********************/
#define  RCC_HSION                                   ((uint32_t)0x00000001)        /* Internal High Speed clock enable */
#define  RCC_HSIRDY                                  ((uint32_t)0x00000002)        /* Internal High Speed clock ready flag */
#define  RCC_HSITRIM                                 ((uint32_t)0x000000F8)        /* Internal High Speed clock trimming */
#define  RCC_HSICAL                                  ((uint32_t)0x0000FF00)        /* Internal High Speed clock Calibration */
#define  RCC_HSEON                                   ((uint32_t)0x00010000)        /* External High Speed clock enable */
#define  RCC_HSERDY                                  ((uint32_t)0x00020000)        /* External High Speed clock ready flag */
#define  RCC_HSEBYP                                  ((uint32_t)0x00040000)        /* External High Speed clock Bypass */
#define  RCC_CSSON                                   ((uint32_t)0x00080000)        /* Clock Security System enable */

#define  RCC_USBHSPLLON                              ((uint32_t)0x00100000) 
#define  RCC_USBHSPLLRDY                             ((uint32_t)0x00200000) 
#define  RCC_ETHPLLON                                ((uint32_t)0x00400000) 
#define  RCC_ETHPLLRDY                               ((uint32_t)0x00800000)
#define  RCC_PLLON                                   ((uint32_t)0x01000000)
#define  RCC_PLLRDY                                  ((uint32_t)0x02000000)

/*******************  Bit definition for RCC_CFGR0 register  *******************/
#define  RCC_SW                                      ((uint32_t)0x00000003)        /* SW[1:0] bits (System clock Switch) */
#define  RCC_SW_0                                    ((uint32_t)0x00000001)        /* Bit 0 */
#define  RCC_SW_1                                    ((uint32_t)0x00000002)        /* Bit 1 */

#define  RCC_SW_HSI                                  ((uint32_t)0x00000000)        /* HSI selected as system clock */
#define  RCC_SW_HSE                                  ((uint32_t)0x00000001)        /* HSE selected as system clock */
#define  RCC_SW_PLL                                  ((uint32_t)0x00000002)        /* PLL selected as system clock */

#define  RCC_SWS                                     ((uint32_t)0x0000000C)        /* SWS[1:0] bits (System Clock Switch Status) */
#define  RCC_SWS_0                                   ((uint32_t)0x00000004)        /* Bit 0 */
#define  RCC_SWS_1                                   ((uint32_t)0x00000008)        /* Bit 1 */

#define  RCC_SWS_HSI                                 ((uint32_t)0x00000000)        /* HSI oscillator used as system clock */
#define  RCC_SWS_HSE                                 ((uint32_t)0x00000004)        /* HSE oscillator used as system clock */
#define  RCC_SWS_PLL                                 ((uint32_t)0x00000008)        /* PLL used as system clock */

#define  RCC_HPRE                                    ((uint32_t)0x000000F0)        /* HPRE[3:0] bits (HB prescaler) */
#define  RCC_HPRE_0                                  ((uint32_t)0x00000010)        /* Bit 0 */
#define  RCC_HPRE_1                                  ((uint32_t)0x00000020)        /* Bit 1 */
#define  RCC_HPRE_2                                  ((uint32_t)0x00000040)        /* Bit 2 */
#define  RCC_HPRE_3                                  ((uint32_t)0x00000080)        /* Bit 3 */

#define  RCC_HPRE_DIV1                               ((uint32_t)0x00000000)        /* SYSCLK not divided */
#define  RCC_HPRE_DIV2                               ((uint32_t)0x00000080)        /* SYSCLK divided by 2 */
#define  RCC_HPRE_DIV4                               ((uint32_t)0x00000090)        /* SYSCLK divided by 4 */
#define  RCC_HPRE_DIV8                               ((uint32_t)0x000000A0)        /* SYSCLK divided by 8 */
#define  RCC_HPRE_DIV16                              ((uint32_t)0x000000B0)        /* SYSCLK divided by 16 */
#define  RCC_HPRE_DIV64                              ((uint32_t)0x000000C0)        /* SYSCLK divided by 64 */
#define  RCC_HPRE_DIV128                             ((uint32_t)0x000000D0)        /* SYSCLK divided by 128 */
#define  RCC_HPRE_DIV256                             ((uint32_t)0x000000E0)        /* SYSCLK divided by 256 */
#define  RCC_HPRE_DIV512                             ((uint32_t)0x000000F0)        /* SYSCLK divided by 512 */

#define  RCC_PPRE1                                   ((uint32_t)0x00000700)        /* PRE1[2:0] bits (PB1 prescaler) */
#define  RCC_PPRE1_0                                 ((uint32_t)0x00000100)        /* Bit 0 */
#define  RCC_PPRE1_1                                 ((uint32_t)0x00000200)        /* Bit 1 */
#define  RCC_PPRE1_2                                 ((uint32_t)0x00000400)        /* Bit 2 */

#define  RCC_PPRE1_DIV1                              ((uint32_t)0x00000000)        /* HCLK not divided */
#define  RCC_PPRE1_DIV2                              ((uint32_t)0x00000400)        /* HCLK divided by 2 */
#define  RCC_PPRE1_DIV4                              ((uint32_t)0x00000500)        /* HCLK divided by 4 */
#define  RCC_PPRE1_DIV8                              ((uint32_t)0x00000600)        /* HCLK divided by 8 */
#define  RCC_PPRE1_DIV16                             ((uint32_t)0x00000700)        /* HCLK divided by 16 */

#define  RCC_PPRE2                                   ((uint32_t)0x00003800)        /* PRE2[2:0] bits (PB2 prescaler) */
#define  RCC_PPRE2_0                                 ((uint32_t)0x00000800)        /* Bit 0 */
#define  RCC_PPRE2_1                                 ((uint32_t)0x00001000)        /* Bit 1 */
#define  RCC_PPRE2_2                                 ((uint32_t)0x00002000)        /* Bit 2 */

#define  RCC_PPRE2_DIV1                              ((uint32_t)0x00000000)        /* HCLK not divided */
#define  RCC_PPRE2_DIV2                              ((uint32_t)0x00002000)        /* HCLK divided by 2 */
#define  RCC_PPRE2_DIV4                              ((uint32_t)0x00002800)        /* HCLK divided by 4 */
#define  RCC_PPRE2_DIV8                              ((uint32_t)0x00003000)        /* HCLK divided by 8 */
#define  RCC_PPRE2_DIV16                             ((uint32_t)0x00003800)        /* HCLK divided by 16 */

#define  RCC_ADCPRE                                  ((uint32_t)0x0000C000)        /* ADCPRE[1:0] bits (ADC prescaler) */
#define  RCC_ADCPRE_0                                ((uint32_t)0x00004000)        /* Bit 0 */
#define  RCC_ADCPRE_1                                ((uint32_t)0x00008000)        /* Bit 1 */

#define  RCC_ADCPRE_DIV2                             ((uint32_t)0x00000000)        /* PCLK2 divided by 2 */
#define  RCC_ADCPRE_DIV4                             ((uint32_t)0x00004000)        /* PCLK2 divided by 4 */
#define  RCC_ADCPRE_DIV6                             ((uint32_t)0x00008000)        /* PCLK2 divided by 6 */
#define  RCC_ADCPRE_DIV8                             ((uint32_t)0x0000C000)        /* PCLK2 divided by 8 */

#define  RCC_PLLSRC                                  ((uint32_t)0x00010000)        /* PLL entry clock source */

#define  RCC_PLLMULL                                 ((uint32_t)0x003E0000)        /* PLLMUL[3:0] bits (PLL multiplication factor) */
#define  RCC_PLLMULL_0                               ((uint32_t)0x00020000)        /* Bit 0 */
#define  RCC_PLLMULL_1                               ((uint32_t)0x00040000)        /* Bit 1 */
#define  RCC_PLLMULL_2                               ((uint32_t)0x00080000)        /* Bit 2 */
#define  RCC_PLLMULL_3                               ((uint32_t)0x00100000)        /* Bit 3 */
#define  RCC_PLLMULL_4                               ((uint32_t)0x00200000)        /* Bit 4 */

#define  RCC_PLLSRC_HSI                              ((uint32_t)0x00000000)        /* HSI clock selected as PLL entry clock source */
#define  RCC_PLLSRC_HSE                              ((uint32_t)0x00010000)        /* HSE clock selected as PLL entry clock source */

#define  RCC_PLLMULL8                                ((uint32_t)0x00000000)        /* PLL input clock*8 */
#define  RCC_PLLMULL9                                ((uint32_t)0x00020000)        /* PLL input clock*9 */
#define  RCC_PLLMULL10                               ((uint32_t)0x00040000)        /* PLL input clock*10 */
#define  RCC_PLLMULL11                               ((uint32_t)0x00060000)        /* PLL input clock*11 */
#define  RCC_PLLMULL12                               ((uint32_t)0x00080000)        /* PLL input clock*12 */
#define  RCC_PLLMULL12_5                             ((uint32_t)0x000A0000)        /* PLL input clock*12.5 */
#define  RCC_PLLMULL13                               ((uint32_t)0x000C0000)        /* PLL input clock*13 */
#define  RCC_PLLMULL13_5                             ((uint32_t)0x000E0000)        /* PLL input clock*13.5 */
#define  RCC_PLLMULL14                               ((uint32_t)0x00100000)        /* PLL input clock*14 */
#define  RCC_PLLMULL14_5                             ((uint32_t)0x00120000)        /* PLL input clock*14.5 */
#define  RCC_PLLMULL15                               ((uint32_t)0x00140000)        /* PLL input clock*15 */
#define  RCC_PLLMULL15_5                             ((uint32_t)0x00160000)        /* PLL input clock*15.5 */
#define  RCC_PLLMULL16                               ((uint32_t)0x00180000)        /* PLL input clock*16 */
#define  RCC_PLLMULL16_5                             ((uint32_t)0x001A0000)        /* PLL input clock*16.5 */
#define  RCC_PLLMULL17                               ((uint32_t)0x001C0000)        /* PLL input clock*17 */
#define  RCC_PLLMULL17_5                             ((uint32_t)0x001E0000)        /* PLL input clock*17.5 */
#define  RCC_PLLMULL18                               ((uint32_t)0x00200000)        /* PLL input clock*18 */
#define  RCC_PLLMULL18_5                             ((uint32_t)0x00220000)        /* PLL input clock*18.5 */
#define  RCC_PLLMULL19                               ((uint32_t)0x00240000)        /* PLL input clock*19 */
#define  RCC_PLLMULL19_5                             ((uint32_t)0x00260000)        /* PLL input clock*19.5 */
#define  RCC_PLLMULL20                               ((uint32_t)0x00280000)        /* PLL input clock*20 */
#define  RCC_PLLMULL21                               ((uint32_t)0x002A0000)        /* PLL input clock*21 */
#define  RCC_PLLMULL22                               ((uint32_t)0x002C0000)        /* PLL input clock*22 */
#define  RCC_PLLMULL24                               ((uint32_t)0x002E0000)        /* PLL input clock*24 */
#define  RCC_PLLMULL26                               ((uint32_t)0x00300000)        /* PLL input clock*26 */
#define  RCC_PLLMULL28                               ((uint32_t)0x00320000)        /* PLL input clock*28 */
#define  RCC_PLLMULL30                               ((uint32_t)0x00340000)        /* PLL input clock*30 */
#define  RCC_PLLMULL32                               ((uint32_t)0x00360000)        /* PLL input clock*32 */
#define  RCC_PLLMULL34                               ((uint32_t)0x00380000)        /* PLL input clock*34 */
#define  RCC_PLLMULL36                               ((uint32_t)0x003A0000)        /* PLL input clock*36 */
#define  RCC_PLLMULL38                               ((uint32_t)0x003C0000)        /* PLL input clock*38 */
#define  RCC_PLLMULL40                               ((uint32_t)0x003E0000)        /* PLL input clock*40 */

#define  RCC_CFGR0_MCO                               ((uint32_t)0x0F000000)        /* MCO[3:0] bits (Microcontroller Clock Output) */
#define  RCC_MCO_0                                   ((uint32_t)0x01000000)        /* Bit 0 */
#define  RCC_MCO_1                                   ((uint32_t)0x02000000)        /* Bit 1 */
#define  RCC_MCO_2                                   ((uint32_t)0x04000000)        /* Bit 2 */
#define  RCC_MCO_3                                   ((uint32_t)0x08000000)        /* Bit 3 */

#define  RCC_MCO_NOCLOCK                             ((uint32_t)0x00000000)        /* No clock */
#define  RCC_CFGR0_MCO_SYSCLK                        ((uint32_t)0x04000000)        /* System clock selected as MCO source */
#define  RCC_CFGR0_MCO_HSI                           ((uint32_t)0x05000000)        /* HSI clock selected as MCO source */
#define  RCC_CFGR0_MCO_HSE                           ((uint32_t)0x06000000)        /* HSE clock selected as MCO source  */
#define  RCC_CFGR0_MCO_UTMI                          ((uint32_t)0x07000000)        
#define  RCC_CFGR0_MCO_ETHPLL_DIV8                   ((uint32_t)0x08000000)
#define  RCC_CFGR0_MCO_XT1                           ((uint32_t)0x0A000000)

#define  RCC_CFGR0_ADCSRC                            ((uint32_t)0x10000000)
#define  RCC_CFGR0_ADCDUTY_SEL2                      ((uint32_t)0x20000000)
#define  RCC_CFGR0_ADCDUTY_SEL                       ((uint32_t)0x40000000)

