XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Startup/ch32v4x7.h
#define  RCC_RTCSEL                                  ((uint32_t)0x00000300)        /* RTCSEL[1:0] bits (RTC clock source selection) */
#define  RCC_RTCSEL_0                                ((uint32_t)0x00000100)        /* Bit 0 */
#define  RCC_RTCSEL_1                                ((uint32_t)0x00000200)        /* Bit 1 */

#define  RCC_RTCSEL_NOCLOCK                          ((uint32_t)0x00000000)        /* No clock */
#define  RCC_RTCSEL_LSE                              ((uint32_t)0x00000100)        /* LSE oscillator clock used as RTC clock */
#define  RCC_RTCSEL_LSI                              ((uint32_t)0x00000200)        /* LSI oscillator clock used as RTC clock */
#define  RCC_RTCSEL_HSE                              ((uint32_t)0x00000300)        

#define  RCC_RTCEN                                   ((uint32_t)0x00008000)        /* RTC clock enable */
#define  RCC_BDRST                                   ((uint32_t)0x00010000)        /* Backup domain software reset  */

/*******************  Bit definition for RCC_RSTSCKR register  ********************/  
#define  RCC_LSION                                   ((uint32_t)0x00000001)        /* Internal Low Speed oscillator enable */
#define  RCC_LSIRDY                                  ((uint32_t)0x00000002)        /* Internal Low Speed oscillator Ready */
#define  RCC_RMVF                                    ((uint32_t)0x01000000)        /* Remove reset flag */
#define  RCC_PINRSTF                                 ((uint32_t)0x04000000)        /* PIN reset flag */
#define  RCC_PORRSTF                                 ((uint32_t)0x08000000)        /* POR/PDR reset flag */
#define  RCC_SFTRSTF                                 ((uint32_t)0x10000000)        /* Software Reset flag */
#define  RCC_IWDGRSTF                                ((uint32_t)0x20000000)        /* Independent Watchdog reset flag */
#define  RCC_WWDGRSTF                                ((uint32_t)0x40000000)        /* Window watchdog reset flag */
#define  RCC_LPWRRSTF                                ((uint32_t)0x80000000)        /* Low-Power reset flag */

/*******************  Bit definition for RCC_HBRSTR register  ********************/  
#define  RCC_LTDCRST                                 ((uint32_t)0x00000008)   
#define  RCC_PSRAMRST                                ((uint32_t)0x00000010)   
#define  RCC_I3CRST                                  ((uint32_t)0x00000020) 
#define  RCC_ARGBRST                                 ((uint32_t)0x00000080) 
#define  RCC_USBHS2RST                               ((uint32_t)0x00000800) 
#define  RCC_USBHS1RST                               ((uint32_t)0x00001000)        
#define  RCC_DVPRST                                  ((uint32_t)0x00002000)        
#define  RCC_ETHMACRST                               ((uint32_t)0x00004000)        

/*******************  Bit definition for RCC_CFGR2 register  ********************/  
#define  RCC_LTDCDIV                                 ((uint32_t)0x0000003F)   /*bit[5:0]*/
#define  RCC_LTDCDIV_0                               ((uint32_t)0x00000001)   /*bit 0*/
#define  RCC_LTDCDIV_1                               ((uint32_t)0x00000002)   /*bit 1*/
#define  RCC_LTDCDIV_2                               ((uint32_t)0x00000004)   /*bit 2*/
#define  RCC_LTDCDIV_3                               ((uint32_t)0x00000008)   /*bit 3*/
#define  RCC_LTDCDIV_4                               ((uint32_t)0x00000010)   /*bit 4*/
#define  RCC_LTDCDIV_5                               ((uint32_t)0x00000020)   /*bit 5*/

#define  RCC_LTDCDIV1                                ((uint32_t)0x00000000) 
#define  RCC_LTDCDIV2                                ((uint32_t)0x00000001)
#define  RCC_LTDCDIV3                                ((uint32_t)0x00000002)
#define  RCC_LTDCDIV4                                ((uint32_t)0x00000003)
#define  RCC_LTDCDIV5                                ((uint32_t)0x00000004)
#define  RCC_LTDCDIV6                                ((uint32_t)0x00000005)
#define  RCC_LTDCDIV7                                ((uint32_t)0x00000006)
#define  RCC_LTDCDIV8                                ((uint32_t)0x00000007)
#define  RCC_LTDCDIV9                                ((uint32_t)0x00000008)
#define  RCC_LTDCDIV10                               ((uint32_t)0x00000009)
#define  RCC_LTDCDIV11                               ((uint32_t)0x0000000A)
#define  RCC_LTDCDIV12                               ((uint32_t)0x0000000B)
#define  RCC_LTDCDIV13                               ((uint32_t)0x0000000C)
#define  RCC_LTDCDIV14                               ((uint32_t)0x0000000D)
#define  RCC_LTDCDIV15                               ((uint32_t)0x0000000E)
#define  RCC_LTDCDIV16                               ((uint32_t)0x0000000F)
#define  RCC_LTDCDIV17                               ((uint32_t)0x00000010)
#define  RCC_LTDCDIV18                               ((uint32_t)0x00000011)
#define  RCC_LTDCDIV19                               ((uint32_t)0x00000012)
#define  RCC_LTDCDIV20                               ((uint32_t)0x00000013)
#define  RCC_LTDCDIV21                               ((uint32_t)0x00000014)
#define  RCC_LTDCDIV22                               ((uint32_t)0x00000015)
#define  RCC_LTDCDIV23                               ((uint32_t)0x00000016)
#define  RCC_LTDCDIV24                               ((uint32_t)0x00000017)
#define  RCC_LTDCDIV25                               ((uint32_t)0x00000018)
#define  RCC_LTDCDIV26                               ((uint32_t)0x00000019)
#define  RCC_LTDCDIV27                               ((uint32_t)0x0000001A)
#define  RCC_LTDCDIV28                               ((uint32_t)0x0000001B)
#define  RCC_LTDCDIV29                               ((uint32_t)0x0000001C)
#define  RCC_LTDCDIV30                               ((uint32_t)0x0000001D)
#define  RCC_LTDCDIV31                               ((uint32_t)0x0000001E)
#define  RCC_LTDCDIV32                               ((uint32_t)0x0000001F)
#define  RCC_LTDCDIV33                               ((uint32_t)0x00000020)
#define  RCC_LTDCDIV34                               ((uint32_t)0x00000021)
#define  RCC_LTDCDIV35                               ((uint32_t)0x00000022)
#define  RCC_LTDCDIV36                               ((uint32_t)0x00000023)
#define  RCC_LTDCDIV37                               ((uint32_t)0x00000024)
#define  RCC_LTDCDIV38                               ((uint32_t)0x00000025)
#define  RCC_LTDCDIV39                               ((uint32_t)0x00000026)
#define  RCC_LTDCDIV40                               ((uint32_t)0x00000027)
#define  RCC_LTDCDIV41                               ((uint32_t)0x00000028)
#define  RCC_LTDCDIV42                               ((uint32_t)0x00000029)
#define  RCC_LTDCDIV43                               ((uint32_t)0x0000002A)
#define  RCC_LTDCDIV44                               ((uint32_t)0x0000002B)
#define  RCC_LTDCDIV45                               ((uint32_t)0x0000002C)
#define  RCC_LTDCDIV46                               ((uint32_t)0x0000002D)
#define  RCC_LTDCDIV47                               ((uint32_t)0x0000002E)
#define  RCC_LTDCDIV48                               ((uint32_t)0x0000002F)
#define  RCC_LTDCDIV49                               ((uint32_t)0x00000030)
#define  RCC_LTDCDIV50                               ((uint32_t)0x00000031)
#define  RCC_LTDCDIV51                               ((uint32_t)0x00000032)
#define  RCC_LTDCDIV52                               ((uint32_t)0x00000033)
#define  RCC_LTDCDIV53                               ((uint32_t)0x00000034)
#define  RCC_LTDCDIV54                               ((uint32_t)0x00000035)
#define  RCC_LTDCDIV55                               ((uint32_t)0x00000036)
#define  RCC_LTDCDIV56                               ((uint32_t)0x00000037)
#define  RCC_LTDCDIV57                               ((uint32_t)0x00000038)
#define  RCC_LTDCDIV58                               ((uint32_t)0x00000039)
#define  RCC_LTDCDIV59                               ((uint32_t)0x0000003A)
#define  RCC_LTDCDIV60                               ((uint32_t)0x0000003B)
#define  RCC_LTDCDIV61                               ((uint32_t)0x0000003C)
#define  RCC_LTDCDIV62                               ((uint32_t)0x0000003D)
#define  RCC_LTDCDIV63                               ((uint32_t)0x0000003E)
#define  RCC_LTDCDIV64                               ((uint32_t)0x0000003F)

#define  RCC_LTDCSRC                                 ((uint32_t)0x00000040)
#define  RCC_I2SPLLCSRC                              ((uint32_t)0x00000080)

#define  RCC_SYSPLLDIV                               ((uint32_t)0x00000700) /*bit[2:0]*/
#define  RCC_SYSPLLDIV_0                             ((uint32_t)0x00000100)
#define  RCC_SYSPLLDIV_1                             ((uint32_t)0x00000200)
#define  RCC_SYSPLLDIV_2                             ((uint32_t)0x00000400)

#define  RCC_SYSPLLDIV1                              ((uint32_t)0x00000000)
#define  RCC_SYSPLLDIV2                              ((uint32_t)0x00000100)
#define  RCC_SYSPLLDIV3                              ((uint32_t)0x00000200)
#define  RCC_SYSPLLDIV4                              ((uint32_t)0x00000300)
#define  RCC_SYSPLLDIV5                              ((uint32_t)0x00000400)
#define  RCC_SYSPLLDIV6                              ((uint32_t)0x00000500)
#define  RCC_SYSPLLDIV7                              ((uint32_t)0x00000600)
#define  RCC_SYSPLLDIV8                              ((uint32_t)0x00000700)

#define  RCC_SYSPLL_GATE                             ((uint32_t)0x00001000)

#define  RCC_SYSPLLSRC                               ((uint32_t)0x0000E000) /*bit[2:0]*/
#define  RCC_SYSPLLSRC_0                             ((uint32_t)0x00002000)
#define  RCC_SYSPLLSRC_1                             ((uint32_t)0x00004000)
#define  RCC_SYSPLLSRC_2                             ((uint32_t)0x00008000)

#define  RCC_SYSPLLSRC_USBHSPLL                      ((uint32_t)0x00000000)
#define  RCC_SYSPLLSRC_ETHPLL                        ((uint32_t)0x00002000)
#define  RCC_SYSPLLSRC_USBHSPLL_MUL2_DIV3            ((uint32_t)0x00004000)
#define  RCC_SYSPLLSRC_ETHPLL_MUL2_DIV3              ((uint32_t)0x00006000)
#define  RCC_SYSPLLSRC_PLL                           ((uint32_t)0x0000C000)

