XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Startup/ch32v4x7.h
#define  RCC_I2S2SRC                                 ((uint32_t)0x00020000)   
#define  RCC_I2S3SRC                                 ((uint32_t)0x00040000)   
#define  RCC_RNGSRC                                  ((uint32_t)0x00080000)   

#define  RCC_USBHSPLLSRC                             ((uint32_t)0x0C000000)  /*bit[1:0]*/
#define  RCC_USBHSPLLSRC_0                           ((uint32_t)0x04000000)
#define  RCC_USBHSPLLSRC_1                           ((uint32_t)0x08000000)

#define  RCC_USBHSPLLSRC_HSE                         ((uint32_t)0x00000000)
#define  RCC_USBHSPLLSRC_HSI                         ((uint32_t)0x04000000)
#define  RCC_USBHSPLLSRC_ETHCLK_20M                  ((uint32_t)0x08000000)

#define  RCC_USBHSPLLCLK                             ((uint32_t)0x30000000)  /*bit[1:0]*/
#define  RCC_USBHSPLLCLK_0                           ((uint32_t)0x10000000)
#define  RCC_USBHSPLLCLK_1                           ((uint32_t)0x20000000)

#define  RCC_USBHSPLLCLK_25M                         ((uint32_t)0x00000000) 
#define  RCC_USBHSPLLCLK_20M                         ((uint32_t)0x10000000)
#define  RCC_USBHSPLLCLK_24M                         ((uint32_t)0x20000000)
#define  RCC_USBHSPLLCLK_32M                         ((uint32_t)0x30000000)

#define  RCC_UTMI2ON                                 ((uint32_t)0x40000000)
#define  RCC_UTMI1ON                                 ((uint32_t)0x80000000)

/*******************  Bit definition for RCC_CFGR3 register  ********************/  
#define  RCC_ADC_CLKDIV                              ((uint32_t)0x0000001F)   /*bit[4:0]*/
#define  RCC_ADC_CLKDIV_0                            ((uint32_t)0x00000001)   /*bit 0*/
#define  RCC_ADC_CLKDIV_1                            ((uint32_t)0x00000002)   /*bit 1*/
#define  RCC_ADC_CLKDIV_2                            ((uint32_t)0x00000004)   /*bit 2*/
#define  RCC_ADC_CLKDIV_3                            ((uint32_t)0x00000008)   /*bit 3*/
#define  RCC_ADC_CLKDIV_4                            ((uint32_t)0x00000010)   /*bit 4*/

#define  RCC_ADC_CLKDIV1                             ((uint32_t)0x00000000) 
#define  RCC_ADC_CLKDIV2                             ((uint32_t)0x00000001)
#define  RCC_ADC_CLKDIV3                             ((uint32_t)0x00000002)
#define  RCC_ADC_CLKDIV4                             ((uint32_t)0x00000003)
#define  RCC_ADC_CLKDIV5                             ((uint32_t)0x00000004)
#define  RCC_ADC_CLKDIV6                             ((uint32_t)0x00000005)
#define  RCC_ADC_CLKDIV7                             ((uint32_t)0x00000006)
#define  RCC_ADC_CLKDIV8                             ((uint32_t)0x00000007)
#define  RCC_ADC_CLKDIV9                             ((uint32_t)0x00000008)
#define  RCC_ADC_CLKDIV10                            ((uint32_t)0x00000009)
#define  RCC_ADC_CLKDIV11                            ((uint32_t)0x0000000A)
#define  RCC_ADC_CLKDIV12                            ((uint32_t)0x0000000B)
#define  RCC_ADC_CLKDIV13                            ((uint32_t)0x0000000C)
#define  RCC_ADC_CLKDIV14                            ((uint32_t)0x0000000D)
#define  RCC_ADC_CLKDIV15                            ((uint32_t)0x0000000E)
#define  RCC_ADC_CLKDIV16                            ((uint32_t)0x0000000F)
#define  RCC_ADC_CLKDIV17                            ((uint32_t)0x00000010)
#define  RCC_ADC_CLKDIV18                            ((uint32_t)0x00000011)
#define  RCC_ADC_CLKDIV19                            ((uint32_t)0x00000012)
#define  RCC_ADC_CLKDIV20                            ((uint32_t)0x00000013)
#define  RCC_ADC_CLKDIV21                            ((uint32_t)0x00000014)
#define  RCC_ADC_CLKDIV22                            ((uint32_t)0x00000015)
#define  RCC_ADC_CLKDIV23                            ((uint32_t)0x00000016)
#define  RCC_ADC_CLKDIV24                            ((uint32_t)0x00000017)
#define  RCC_ADC_CLKDIV25                            ((uint32_t)0x00000018)
#define  RCC_ADC_CLKDIV26                            ((uint32_t)0x00000019)
#define  RCC_ADC_CLKDIV27                            ((uint32_t)0x0000001A)
#define  RCC_ADC_CLKDIV28                            ((uint32_t)0x0000001B)
#define  RCC_ADC_CLKDIV29                            ((uint32_t)0x0000001C)
#define  RCC_ADC_CLKDIV30                            ((uint32_t)0x0000001D)
#define  RCC_ADC_CLKDIV31                            ((uint32_t)0x0000001E)
#define  RCC_ADC_CLKDIV32                            ((uint32_t)0x0000001F)

/******************************************************************************/
/*                                    RNG                                     */
/******************************************************************************/
/********************  Bit definition for RNG_CR register  *******************/
#define  RNG_CR_RNGEN                                ((uint32_t)0x00000004)
#define  RNG_CR_IE                                   ((uint32_t)0x00000008)

/********************  Bit definition for RNG_SR register  *******************/
#define  RNG_SR_DRDY                                 ((uint32_t)0x00000001)
#define  RNG_SR_CECS                                 ((uint32_t)0x00000002)
#define  RNG_SR_SECS                                 ((uint32_t)0x00000004)
#define  RNG_SR_CEIS                                 ((uint32_t)0x00000020)
#define  RNG_SR_SEIS                                 ((uint32_t)0x00000040)

/******************************************************************************/
/*                             Real-Time Clock                                */
/******************************************************************************/

/*******************  Bit definition for RTC_CTLRH register  ********************/
#define  RTC_CTLRH_SECIE                             ((uint8_t)0x01)               /* Second Interrupt Enable */
#define  RTC_CTLRH_ALRIE                             ((uint8_t)0x02)               /* Alarm Interrupt Enable */
#define  RTC_CTLRH_OWIE                              ((uint8_t)0x04)               /* OverfloW Interrupt Enable */

/*******************  Bit definition for RTC_CTLRL register  ********************/
#define  RTC_CTLRL_SECF                              ((uint8_t)0x01)               /* Second Flag */
#define  RTC_CTLRL_ALRF                              ((uint8_t)0x02)               /* Alarm Flag */
#define  RTC_CTLRL_OWF                               ((uint8_t)0x04)               /* OverfloW Flag */
#define  RTC_CTLRL_RSF                               ((uint8_t)0x08)               /* Registers Synchronized Flag */
#define  RTC_CTLRL_CNF                               ((uint8_t)0x10)               /* Configuration Flag */
#define  RTC_CTLRL_RTOFF                             ((uint8_t)0x20)               /* RTC operation OFF */

