XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Startup/ch32v4x7.h
/******************  Bit definition for SPI_I2SCFGR register  *****************/
#define  SPI_I2SCFGR_CHLEN                           ((uint16_t)0x0001)            /* Channel length (number of bits per audio channel) */

#define  SPI_I2SCFGR_DATLEN                          ((uint16_t)0x0006)            /* DATLEN[1:0] bits (Data length to be transferred) */
#define  SPI_I2SCFGR_DATLEN_0                        ((uint16_t)0x0002)            /* Bit 0 */
#define  SPI_I2SCFGR_DATLEN_1                        ((uint16_t)0x0004)            /* Bit 1 */

#define  SPI_I2SCFGR_CKPOL                           ((uint16_t)0x0008)            /* steady state clock polarity */

#define  SPI_I2SCFGR_I2SSTD                          ((uint16_t)0x0030)            /* I2SSTD[1:0] bits (I2S standard selection) */
#define  SPI_I2SCFGR_I2SSTD_0                        ((uint16_t)0x0010)            /* Bit 0 */
#define  SPI_I2SCFGR_I2SSTD_1                        ((uint16_t)0x0020)            /* Bit 1 */

#define  SPI_I2SCFGR_PCMSYNC                         ((uint16_t)0x0080)            /* PCM frame synchronization */

#define  SPI_I2SCFGR_I2SCFG                          ((uint16_t)0x0300)            /* I2SCFG[1:0] bits (I2S configuration mode) */
#define  SPI_I2SCFGR_I2SCFG_0                        ((uint16_t)0x0100)            /* Bit 0 */
#define  SPI_I2SCFGR_I2SCFG_1                        ((uint16_t)0x0200)            /* Bit 1 */

#define  SPI_I2SCFGR_I2SE                            ((uint16_t)0x0400)            /* I2S Enable */
#define  SPI_I2SCFGR_I2SMOD                          ((uint16_t)0x0800)            /* I2S mode selection */

/******************  Bit definition for SPI_I2SPR register  *******************/
#define  SPI_I2SPR_I2SDIV                            ((uint16_t)0x00FF)            /* I2S Linear prescaler */
#define  SPI_I2SPR_ODD                               ((uint16_t)0x0100)            /* Odd factor for the prescaler */
#define  SPI_I2SPR_MCKOE                             ((uint16_t)0x0200)            /* Master Clock Output Enable */

/******************  Bit definition for SPI_HSCR register  *******************/
#define  SPI_HSCR_HSRXEN                             ((uint16_t)0x0001)            
#define  SPI_HSCR_HSRXEN2                            ((uint16_t)0x0004)   
#define  SPI_HSCR_I2CWSSYNC                          ((uint16_t)0x0008)          

/******************************************************************************/
/*                                    TIM                                     */
/******************************************************************************/

/*******************  Bit definition for TIM_CTLR1 register  ********************/
#define  TIM_CEN                                     ((uint16_t)0x0001)            /* Counter enable */
#define  TIM_UDIS                                    ((uint16_t)0x0002)            /* Update disable */
#define  TIM_URS                                     ((uint16_t)0x0004)            /* Update request source */
#define  TIM_OPM                                     ((uint16_t)0x0008)            /* One pulse mode */
#define  TIM_DIR                                     ((uint16_t)0x0010)            /* Direction */

#define  TIM_CMS                                     ((uint16_t)0x0060)            /* CMS[1:0] bits (Center-aligned mode selection) */
#define  TIM_CMS_0                                   ((uint16_t)0x0020)            /* Bit 0 */
#define  TIM_CMS_1                                   ((uint16_t)0x0040)            /* Bit 1 */

#define  TIM_ARPE                                    ((uint16_t)0x0080)            /* Auto-reload preload enable */

#define  TIM_CTLR1_CKD                               ((uint16_t)0x0300)            /* CKD[1:0] bits (clock division) */
#define  TIM_CKD_0                                   ((uint16_t)0x0100)            /* Bit 0 */
#define  TIM_CKD_1                                   ((uint16_t)0x0200)            /* Bit 1 */

/*******************  Bit definition for TIM_CTLR2 register  ********************/
#define  TIM_CCPC                                    ((uint16_t)0x0001)            /* Capture/Compare Preloaded Control */
#define  TIM_CCUS                                    ((uint16_t)0x0004)            /* Capture/Compare Control Update Selection */
#define  TIM_CCDS                                    ((uint16_t)0x0008)            /* Capture/Compare DMA Selection */

#define  TIM_MMS                                     ((uint16_t)0x0070)            /* MMS[2:0] bits (Master Mode Selection) */
#define  TIM_MMS_0                                   ((uint16_t)0x0010)            /* Bit 0 */
#define  TIM_MMS_1                                   ((uint16_t)0x0020)            /* Bit 1 */
#define  TIM_MMS_2                                   ((uint16_t)0x0040)            /* Bit 2 */

#define  TIM_TI1S                                    ((uint16_t)0x0080)            /* TI1 Selection */
#define  TIM_OIS1                                    ((uint16_t)0x0100)            /* Output Idle state 1 (OC1 output) */
#define  TIM_OIS1N                                   ((uint16_t)0x0200)            /* Output Idle state 1 (OC1N output) */
#define  TIM_OIS2                                    ((uint16_t)0x0400)            /* Output Idle state 2 (OC2 output) */
#define  TIM_OIS2N                                   ((uint16_t)0x0800)            /* Output Idle state 2 (OC2N output) */
#define  TIM_OIS3                                    ((uint16_t)0x1000)            /* Output Idle state 3 (OC3 output) */
#define  TIM_OIS3N                                   ((uint16_t)0x2000)            /* Output Idle state 3 (OC3N output) */
#define  TIM_OIS4                                    ((uint16_t)0x4000)            /* Output Idle state 4 (OC4 output) */

/*******************  Bit definition for TIM_SMCFGR register  *******************/
#define  TIM_SMS                                     ((uint16_t)0x0007)            /* SMS[2:0] bits (Slave mode selection) */
#define  TIM_SMS_0                                   ((uint16_t)0x0001)            /* Bit 0 */
#define  TIM_SMS_1                                   ((uint16_t)0x0002)            /* Bit 1 */
#define  TIM_SMS_2                                   ((uint16_t)0x0004)            /* Bit 2 */

#define  TIM_TS                                      ((uint16_t)0x0070)            /* TS[2:0] bits (Trigger selection) */
#define  TIM_TS_0                                    ((uint16_t)0x0010)            /* Bit 0 */
#define  TIM_TS_1                                    ((uint16_t)0x0020)            /* Bit 1 */
#define  TIM_TS_2                                    ((uint16_t)0x0040)            /* Bit 2 */

#define  TIM_MSM                                     ((uint16_t)0x0080)            /* Master/slave mode */

#define  TIM_ETF                                     ((uint16_t)0x0F00)            /* ETF[3:0] bits (External trigger filter) */
#define  TIM_ETF_0                                   ((uint16_t)0x0100)            /* Bit 0 */
#define  TIM_ETF_1                                   ((uint16_t)0x0200)            /* Bit 1 */
#define  TIM_ETF_2                                   ((uint16_t)0x0400)            /* Bit 2 */
#define  TIM_ETF_3                                   ((uint16_t)0x0800)            /* Bit 3 */

