XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Startup/ch32v4x7.h
#define  TIM_ETPS                                    ((uint16_t)0x3000)            /* ETPS[1:0] bits (External trigger prescaler) */
#define  TIM_ETPS_0                                  ((uint16_t)0x1000)            /* Bit 0 */
#define  TIM_ETPS_1                                  ((uint16_t)0x2000)            /* Bit 1 */

#define  TIM_ECE                                     ((uint16_t)0x4000)            /* External clock enable */
#define  TIM_ETP                                     ((uint16_t)0x8000)            /* External trigger polarity */

/*******************  Bit definition for TIM_DMAINTENR register  *******************/
#define  TIM_UIE                                     ((uint16_t)0x0001)            /* Update interrupt enable */
#define  TIM_CC1IE                                   ((uint16_t)0x0002)            /* Capture/Compare 1 interrupt enable */
#define  TIM_CC2IE                                   ((uint16_t)0x0004)            /* Capture/Compare 2 interrupt enable */
#define  TIM_CC3IE                                   ((uint16_t)0x0008)            /* Capture/Compare 3 interrupt enable */
#define  TIM_CC4IE                                   ((uint16_t)0x0010)            /* Capture/Compare 4 interrupt enable */
#define  TIM_COMIE                                   ((uint16_t)0x0020)            /* COM interrupt enable */
#define  TIM_TIE                                     ((uint16_t)0x0040)            /* Trigger interrupt enable */
#define  TIM_BIE                                     ((uint16_t)0x0080)            /* Break interrupt enable */
#define  TIM_UDE                                     ((uint16_t)0x0100)            /* Update DMA request enable */
#define  TIM_CC1DE                                   ((uint16_t)0x0200)            /* Capture/Compare 1 DMA request enable */
#define  TIM_CC2DE                                   ((uint16_t)0x0400)            /* Capture/Compare 2 DMA request enable */
#define  TIM_CC3DE                                   ((uint16_t)0x0800)            /* Capture/Compare 3 DMA request enable */
#define  TIM_CC4DE                                   ((uint16_t)0x1000)            /* Capture/Compare 4 DMA request enable */
#define  TIM_COMDE                                   ((uint16_t)0x2000)            /* COM DMA request enable */
#define  TIM_TDE                                     ((uint16_t)0x4000)            /* Trigger DMA request enable */

/********************  Bit definition for TIM_INTFR register  ********************/
#define  TIM_UIF                                     ((uint16_t)0x0001)            /* Update interrupt Flag */
#define  TIM_CC1IF                                   ((uint16_t)0x0002)            /* Capture/Compare 1 interrupt Flag */
#define  TIM_CC2IF                                   ((uint16_t)0x0004)            /* Capture/Compare 2 interrupt Flag */
#define  TIM_CC3IF                                   ((uint16_t)0x0008)            /* Capture/Compare 3 interrupt Flag */
#define  TIM_CC4IF                                   ((uint16_t)0x0010)            /* Capture/Compare 4 interrupt Flag */
#define  TIM_COMIF                                   ((uint16_t)0x0020)            /* COM interrupt Flag */
#define  TIM_TIF                                     ((uint16_t)0x0040)            /* Trigger interrupt Flag */
#define  TIM_BIF                                     ((uint16_t)0x0080)            /* Break interrupt Flag */
#define  TIM_CC1OF                                   ((uint16_t)0x0200)            /* Capture/Compare 1 Overcapture Flag */
#define  TIM_CC2OF                                   ((uint16_t)0x0400)            /* Capture/Compare 2 Overcapture Flag */
#define  TIM_CC3OF                                   ((uint16_t)0x0800)            /* Capture/Compare 3 Overcapture Flag */
#define  TIM_CC4OF                                   ((uint16_t)0x1000)            /* Capture/Compare 4 Overcapture Flag */

/*******************  Bit definition for TIM_SWEVGR register  ********************/
#define  TIM_UG                                      ((uint8_t)0x01)               /* Update Generation */
#define  TIM_CC1G                                    ((uint8_t)0x02)               /* Capture/Compare 1 Generation */
#define  TIM_CC2G                                    ((uint8_t)0x04)               /* Capture/Compare 2 Generation */
#define  TIM_CC3G                                    ((uint8_t)0x08)               /* Capture/Compare 3 Generation */
#define  TIM_CC4G                                    ((uint8_t)0x10)               /* Capture/Compare 4 Generation */
#define  TIM_COMG                                    ((uint8_t)0x20)               /* Capture/Compare Control Update Generation */
#define  TIM_TG                                      ((uint8_t)0x40)               /* Trigger Generation */
#define  TIM_BG                                      ((uint8_t)0x80)               /* Break Generation */

/******************  Bit definition for TIM_CHCTLR1 register  *******************/
#define  TIM_CC1S                                    ((uint16_t)0x0003)            /* CC1S[1:0] bits (Capture/Compare 1 Selection) */
#define  TIM_CC1S_0                                  ((uint16_t)0x0001)            /* Bit 0 */
#define  TIM_CC1S_1                                  ((uint16_t)0x0002)            /* Bit 1 */

#define  TIM_OC1FE                                   ((uint16_t)0x0004)            /* Output Compare 1 Fast enable */
#define  TIM_OC1PE                                   ((uint16_t)0x0008)            /* Output Compare 1 Preload enable */

#define  TIM_OC1M                                    ((uint16_t)0x0070)            /* OC1M[2:0] bits (Output Compare 1 Mode) */
#define  TIM_OC1M_0                                  ((uint16_t)0x0010)            /* Bit 0 */
#define  TIM_OC1M_1                                  ((uint16_t)0x0020)            /* Bit 1 */
#define  TIM_OC1M_2                                  ((uint16_t)0x0040)            /* Bit 2 */

#define  TIM_OC1CE                                   ((uint16_t)0x0080)            /* Output Compare 1Clear Enable */

