XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Startup/ch32v4x7.h
/*******************  Bit definition for LTDC_DCCR register  *******************/
#define  LTDC_DCCR_DCBLUE                            ((uint32_t)0x000000FF)
#define  LTDC_DCCR_DCGREEN                           ((uint32_t)0x0000FF00)
#define  LTDC_DCCR_DCRED                             ((uint32_t)0x00FF0000)

/*******************  Bit definition for LTDC_CFBAR register  *******************/
#define  LTDC_CFBAR_CFBADD                           ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for LTDC_CFBLR register  *******************/
#define  LTDC_CFBLR_CFBLL                            ((uint32_t)0x00001FFF)
#define  LTDC_CFBLR_CFBP                             ((uint32_t)0x1FFF0000)

/*******************  Bit definition for LTDC_CFBLNR register  *******************/
#define  LTDC_CFBLNR_CFBLNBR                         ((uint32_t)0x000007FF)

/*******************  Bit definition for LTDC_CLUTWR register  *******************/
#define  LTDC_CLUTWR_BLUE                            ((uint32_t)0x000000FF)
#define  LTDC_CLUTWR_GREEN                           ((uint32_t)0x0000FF00)
#define  LTDC_CLUTWR_RED                             ((uint32_t)0x00FF0000)
#define  LTDC_CLUTWR_CLUTADD                         ((uint32_t)0xFF000000)

/******************************************************************************/
/*                                 ARGB                                     */
/******************************************************************************/
/*******************  Bit definition for ARGB_CTLR register  *******************/
#define  ARGB_TE                                     ((uint32_t)0x00000001)
#define  ARGB_DMAEN                                  ((uint32_t)0x00000002)
#define  ARGB_MODE                                   ((uint32_t)0x00000004)
#define  ARGB_LSB                                    ((uint32_t)0x00000008)

#define  ARGB_FRHIE                                  ((uint32_t)0x00000100)
#define  ARGB_RSTIE                                  ((uint32_t)0x00000200)
#define  ARGB_TCIE                                   ((uint32_t)0x00000400)
#define  ARGB_BYTEIE                                 ((uint32_t)0x00000800)
#define  ARGB_HALFIE                                 ((uint32_t)0x00001000)
#define  ARGB_TXEIE                                  ((uint32_t)0x00002000)

/*******************  Bit definition for ARGB_DAT_ARR register  *******************/
#define  ARGB_DAT_ARR                                ((uint32_t)0x00000FFF)

/*******************  Bit definition for ARGB_RST_ARR register  *******************/
#define  ARGB_RST_ARR                                ((uint32_t)0x0001FFFF)

/*******************  Bit definition for ARGB_CCRL register  *******************/
#define  ARGB_CCRL                                   ((uint32_t)0x00000FFF)

/*******************  Bit definition for ARGB_CCRH register  *******************/
#define  ARGB_CCRH                                   ((uint32_t)0x00000FFF)

/*****************  Bit definition for ARGB_DAT_CYC register  ******************/
#define  ARGB_DAT_CYC                                ((uint32_t)0x0000FFFF)

/****************  Bit definition for ARGB_DAT_DATAR register  *****************/
#define  ARGB_DATA                                   ((uint32_t)0x000000FF)

/****************  Bit definition for ARGB_STATR register  *****************/
#define  ARGB_FRHIF                                  ((uint32_t)0x00000001)
#define  ARGB_RSTIF                                  ((uint32_t)0x00000002)
#define  ARGB_TCIF                                   ((uint32_t)0x00000004)
#define  ARGB_BYTEIF                                 ((uint32_t)0x00000008)
#define  ARGB_HALFIF                                 ((uint32_t)0x00000010)
#define  ARGB_TXEIF                                  ((uint32_t)0x00000020)
	
#define  ARGB_STATE                                  ((uint32_t)0x000000C0)
#define  ARGB_STATE_0                                ((uint32_t)0x00000040)
#define  ARGB_STATE_1                                ((uint32_t)0x00000080)

#define  ARGB_BIT_CNT                                ((uint32_t)0x00000700)
#define  ARGB_BYTE_CNT                               ((uint32_t)0xFFFF0000)

/****************  Bit definition for ARGB_CNTR register  *****************/
#define  ARGB_CNT                                    ((uint32_t)0x0001FFFF)

/******************************************************************************/
/*                                 PSRAM                                    */
/******************************************************************************/
/*******************  Bit definition for PSRAM_CTLR register  *******************/
#define  PSRAM_CFIFO                                 ((uint32_t)0x00000010)
#define  PSRAM_DFIFO                                 ((uint32_t)0x00000020)

#define  PSRAM_CAPCFG                                ((uint32_t)0x00000700) /*bit[2:0]*/
#define  PSRAM_CAPCFG_0                              ((uint32_t)0x00000100)
#define  PSRAM_CAPCFG_1                              ((uint32_t)0x00000200)
#define  PSRAM_CAPCFG_2                              ((uint32_t)0x00000400)

#define  PSRAM_CAPCFG_32M                            ((uint32_t)0x00000100)
#define  PSRAM_CAPCFG_64M                            ((uint32_t)0x00000300)
#define  PSRAM_CAPCFG_128M                           ((uint32_t)0x00000500)
#define  PSRAM_CAPCFG_256M                           ((uint32_t)0x00000700)

#define  PSRAM_EXIT_LPMD                             ((uint32_t)0x00010000)

/*******************  Bit definition for PSRAM_TIMING register  *******************/
#define  PSRAM_TRC                                   ((uint32_t)0x000000FF)
#define  PSRAM_TCPH                                  ((uint32_t)0x00FF0000)
#define  PSRAM_TXPHS                                 ((uint32_t)0xFF000000)

/*******************  Bit definition for PSRAM_DATA register  *******************/
#define  PSRAM_RW_LDATA                              ((uint32_t)0x000000FF)
#define  PSRAM_RW_HDATA                              ((uint32_t)0x0000FF00)

/*******************  Bit definition for PSRAM_ADDR register  *******************/
#define  PSRAM_BUSY                                  ((uint32_t)0x00000001)
#define  PSRAM_MW                                    ((uint32_t)0x00000002)

