XIVN1987/MCUCode/board_CH32V/CH32V407/src/CSL/Startup/ch32v4x7.h
#define  PSRAM_CMD                                   ((uint32_t)0x0000FF00)
#define  PSRAM_MR_ADDR0                              ((uint32_t)0x00FF0000)

/*******************  Bit definition for PSRAM_CMD0_CFG register  *******************/
#define  PSRAM_Sync_Read                             ((uint32_t)0x000000FF)
#define  PSRAM_Sync_Write                            ((uint32_t)0x0000FF00)
#define  PSRAM_Sync_Read_LB                          ((uint32_t)0x00FF0000)
#define  PSRAM_Sync_Write_LB                         ((uint32_t)0xFF000000)

/*******************  Bit definition for PSRAM_CMD1_CFG register  *******************/
#define  PSRAM_Mode_Register_Read                    ((uint32_t)0x000000FF)
#define  PSRAM_Mode_Register_Write                   ((uint32_t)0x0000FF00)
#define  PSRAM_Mode_Global_Reset                     ((uint32_t)0x00FF0000)
#define  PSRAM_Mode_Refresh                          ((uint32_t)0xFF000000)

/*******************  Bit definition for PSRAM_DMACR register  *******************/
#define  PSRAM_DMAEN                                 ((uint32_t)0x00000001)
#define  PSRAM_DATDIR                                ((uint32_t)0x00000010)

#define  PSRAM_MEMORYSIZE                            ((uint32_t)0x00000C00)
#define  PSRAM_MEMORYSIZE_0                          ((uint32_t)0x00000400)
#define  PSRAM_MEMORYSIZE_1                          ((uint32_t)0x00000800)

#define  PSRAM_MEMORYSIZE_16bit                      ((uint32_t)0x00000400)
#define  PSRAM_MEMORYSIZE_32bit                      ((uint32_t)0x00000800)

#define  PSRAM_DMAONEBL                              ((uint32_t)0x000F0000)
#define  PSRAM_DMAONEBL_0                            ((uint32_t)0x00010000)
#define  PSRAM_DMAONEBL_1                            ((uint32_t)0x00020000)
#define  PSRAM_DMAONEBL_2                            ((uint32_t)0x00040000)
#define  PSRAM_DMAONEBL_3                            ((uint32_t)0x00080000)

#define  PSRAM_DMAONEBL2                             ((uint32_t)0x00000000)
#define  PSRAM_DMAONEBL4                             ((uint32_t)0x00010000)
#define  PSRAM_DMAONEBL6                             ((uint32_t)0x00020000)
#define  PSRAM_DMAONEBL8                             ((uint32_t)0x00030000)
#define  PSRAM_DMAONEBL16                            ((uint32_t)0x00040000)

#define  PSRAM_TOWBLTOUT                             ((uint32_t)0x00F00000)
#define  PSRAM_TOWBLTOUT_0                           ((uint32_t)0x00100000)
#define  PSRAM_TOWBLTOUT_1                           ((uint32_t)0x00200000)
#define  PSRAM_TOWBLTOUT_2                           ((uint32_t)0x00400000)
#define  PSRAM_TOWBLTOUT_3                           ((uint32_t)0x00800000)

#define  PSRAM_TOWBLTOUT_HCLKMUL0                    ((uint32_t)0x00000000)
#define  PSRAM_TOWBLTOUT_HCLKMUL1                    ((uint32_t)0x00100000)
#define  PSRAM_TOWBLTOUT_HCLKMUL2                    ((uint32_t)0x00200000)
#define  PSRAM_TOWBLTOUT_HCLKMUL3                    ((uint32_t)0x00300000)
#define  PSRAM_TOWBLTOUT_HCLKMUL4                    ((uint32_t)0x00400000)
#define  PSRAM_TOWBLTOUT_HCLKMUL5                    ((uint32_t)0x00500000)
#define  PSRAM_TOWBLTOUT_HCLKMUL6                    ((uint32_t)0x00600000)
#define  PSRAM_TOWBLTOUT_HCLKMUL7                    ((uint32_t)0x00700000)
#define  PSRAM_TOWBLTOUT_HCLKMUL8                    ((uint32_t)0x00800000)
#define  PSRAM_TOWBLTOUT_HCLKMUL9                    ((uint32_t)0x00900000)
#define  PSRAM_TOWBLTOUT_HCLKMUL10                   ((uint32_t)0x00A00000)
#define  PSRAM_TOWBLTOUT_HCLKMUL11                   ((uint32_t)0x00B00000)
#define  PSRAM_TOWBLTOUT_HCLKMUL12                   ((uint32_t)0x00C00000)
#define  PSRAM_TOWBLTOUT_HCLKMUL13                   ((uint32_t)0x00D00000)
#define  PSRAM_TOWBLTOUT_HCLKMUL14                   ((uint32_t)0x00E00000)
#define  PSRAM_TOWBLTOUT_HCLKMUL15                   ((uint32_t)0x00F00000)

/*******************  Bit definition for PSRAM_DATA_NUM register  *******************/
#define  PSRAM_DATANUM                               ((uint32_t)0x0000FFFF)

/*******************  Bit definition for DMA_MEM_ADDR register  *******************/
#define  PSRAM_DMA_MEM_ADDR                          ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for DMA_PSRAM_ADDR register  *******************/
#define  PSRAM_DMA_PSRAM_ADDR                        ((uint32_t)0xFFFFFFFF)

/*******************  Bit definition for PSRAM_ISR register  *******************/
#define  PSRAM_DMATF                                 ((uint32_t)0x00000002)
#define  PSRAM_CENEIF                                ((uint32_t)0x00000004)
#define  PSRAM_AEIF                                  ((uint32_t)0x00000008)

/*******************  Bit definition for PSRAM_IER register  *******************/
#define  PSRAM_DMATEN                                ((uint32_t)0x00000002)
#define  PSRAM_CENEIEN                               ((uint32_t)0x00000004)
#define  PSRAM_AEIEN                                 ((uint32_t)0x00000008)

/*******************  Bit definition for PSRAM_STATUS register  *******************/
#define  PSRAM_STATE                                 ((uint32_t)0x0000001F)

/*******************  Bit definition for PSRAM_CECFG register  *******************/
#define  PSRAM_CELPD                                 ((uint32_t)0x00000FFF)
#define  PSRAM_CEPWEN                                ((uint32_t)0x00010000)

/*******************  Bit definition for PSRAM_LATENCY register  *******************/
#define  PSRAM_Read_Latency                          ((uint32_t)0x000000FF)
#define  PSRAM_Write_Latency                         ((uint32_t)0x0000FF00)

#include "ch32v4x7_conf.h"


#ifdef __cplusplus
}
#endif

#endif 




